{
  "1": {
    "content": "Chapter 2 Wiring and Protection\n\nArticle 200-210\n\nArticle 200 Use and Identification of Grounded Conductors\n\n200.1 Scope\n\nThis article provides requirements for the following:\n\nIdentification of terminals\nGrounded conductors in premises wiring systems\nIdentification of grounded conductors\n\nInformational Note: See Article 100 for definitions of Grounded Conductor, Equipment Grounding Conductor, and Grounding Electrode Conductor.\n\n200.2 General\n\nGrounded conductors shall comply with 200.2(A) and (B).\n\n(A) Insulation\n\nThe grounded conductor, if insulated, shall have insulation that complies with either one of the following:\n\nIs suitably rated, other than color, for any ungrounded conductor of the same circuit for systems of 1000 volts or less.\nIs rated not less than 600 volts for solidly grounded neutral systems of over 1000 volts in accordance with 250.184(A)\n\n(B) Continuity\n\nThe continuity of a grounded conductor shall not depend on a connection to a metal enclosure, raceway, or cable armor.\n\nInformational Note: See 300.13(B) for the continuity of grounded conductors used in multiwire branch circuits.\n\n200.3 Connection to Grounded System\n\nGrounded conductors of premises wiring systems shall be electrically connected to the supply system grounded conductor to ensure a common, continuous grounded system. For the purpose of this section, electrically connected shall mean making a direct electrical connection capable of carrying current, as distinguished from induced currents.\n\nException: Listed interactive inverters identified for use in distributed resource generation systems such as photovoltaic and fuel cell power systems shall be permitted to be connected to premises wiring without a grounded conductor if the connected premises wiring or utility system includes a grounded conductor.",
    "audio": "https://drive.google.com/file/d/1gUDgv61HiADhCuzvGcCgeUsjJUNbLjwU/view?usp=drive_link"
  },
  "2": {
    "content": "200.4 Neutral Conductors\n\nNeutral conductors shall be installed in accordance with 200.4(A) and (B).\n\n(A) Installation\n\nNeutral conductors shall not be used for more than one branch circuit, for more than one multiwire branch circuit, or for more than one set of ungrounded feeder conductors unless specifically permitted elsewhere in this Code.\n\nInformational Note: See 215.4 for information on common neutrals.\n\n(B) Multiple Circuits\n\nWhere more than one neutral conductor associated with different circuits is in an enclosure, grounded circuit conductors of each circuit shall be identified or grouped to correspond with the ungrounded circuit conductor(s) by wire markers, cable ties, or similar means in at least one location within the enclosure.\n\nException No. 1: The requirement for grouping or identifying shall not apply if the branch-circuit or feeder conductors enter from a cable or a raceway unique to the circuit that makes the grouping obvious.\n\nException No. 2: The requirement for grouping or identifying shall not apply where branch-circuit conductors pass through a box or conduit body without a loop as described in 314.16(B)(1) or without a splice or termination.\n\n200.6 Means of Identifying Grounded Conductors\n\n(A) Sizes 6 AWG or Smaller\n\nThe insulation of grounded conductors of 6 AWG or smaller shall be identified by one of the following means:\n\n1. A continuous white outer finish.\n2. A continuous gray outer finish.\n3. Three continuous white or gray stripes along the conductor's entire length on other than green insulation.\n4. Conductors with white or gray insulation and colored tracer threads in the braid identifying the source of manufacture.\n5. A single-conductor, sunlight-resistant, outdoor-rated cable used as a solidly grounded conductor in photovoltaic power systems, as permitted by 690.31(C)(1), shall be identified at the time of installation by markings at terminations in accordance with 200.6(A)(1) through (A)(4).\n6. The grounded conductor of a mineral-insulated, metal-sheathed cable (Type MI) shall be identified at the time of installation by a distinctive white or gray marking at its terminations. The marking shall encircle the conductor insulation.\n7. Fixture wire shall comply with the requirements for grounded conductor identification in accordance with 402.8.\n8. For aerial cable, the identification shall comply with one of the methods in 200.6(A)(1) through (A)(5), or by means of a ridge located on the exterior of the cable so as to identify it.\n\n(B) Sizes 4 AWG or Larger\n\nAn insulated grounded conductor 4 AWG or larger shall be identified by one of the following means:\n\n1. A continuous white outer finish.\n2. A continuous gray outer finish.\n3. Three continuous white or gray stripes along the entire length on other than green insulation.\n4. At the time of installation, be identified by a distinctive white or gray marking at its terminations. This marking shall encircle the conductor insulation.\n\n(C) Flexible Cords\n\nAn insulated conductor that is intended for use as a grounded conductor, where contained within a flexible cord, shall be identified by a white or gray outer finish or by methods permitted by 400.22.\n\n(D) Grounded Conductors of Different Nominal Voltage Systems\n\nIf grounded conductors of different nominal voltage systems are installed in the same raceway, cable, box, auxiliary gutter, or other type of enclosure, each grounded conductor shall be identified by nominal voltage system. Identification that distinguishes each nominal voltage system grounded conductor shall be permitted by one of the following means:\n\n1. One nominal voltage system grounded conductor shall have an outer covering conforming to 200.6(A) or (B).\n2. The grounded conductor(s) of other nominal voltage systems shall have a different outer covering conforming to 200.6(A) or (B) or by an outer covering of white or gray with a distinguishable colored stripe other than green running along the insulation.\n3. Other and different means of identification allowed by 200.6(A) or (B) shall distinguish each nominal voltage system grounded conductor.\n4. The means of identification shall be documented in a manner that is readily available or shall be permanently posted where the conductors of different nominal voltage systems originate.\n\n(E) Grounded Conductors of Multiconductor Cables\n\nThe insulated grounded conductor(s) in a multiconductor cable shall be identified by a continuous white or gray outer finish or by three continuous white or gray stripes on other than green insulation along its entire length. For conductors that are 4 AWG or larger in cables, identification of the grounded conductor shall be permitted to comply with 200.6(B). For multiconductor flat cable with conductors that are 4 AWG or larger, an external ridge shall be permitted to identify the grounded conductor.\n\nException No. 1: Conductors within multiconductor cables shall be permitted to be re-identified at their terminations at the time of installation by a distinctive white or gray marking or other equally effective means.\n\nException No. 2: The grounded conductor of a multiconductor varnished-cloth-insulated cable shall be permitted to be identified at its terminations at the time of installation by a distinctive white marking or other equally effective means.\n\nInformational Note: The color gray may have been used in the past as an ungrounded conductor. Care should be taken when working on existing systems.",
    "audio": "https://drive.google.com/file/d/1SAGshmDcJaEF59B9RAD8_Oq9DnmldR-j/view?usp=drive_link"
  },
  "3": {
    "content": "200.7 Use of Insulation of a White or Gray Color or With Three Continuous White or Gray Stripes\n\n(A) General\n\nThe following shall be used only for the grounded circuit conductor, unless otherwise permitted in 200.7(B) and (C):\n\nA conductor with continuous white or gray covering\nA conductor with three continuous white or gray stripes on other than green insulation\nA marking of white or gray color at the termination\n\n(B) Circuits of Less Than 50 Volts\n\nA conductor with white or gray color insulation or three continuous white stripes or having a marking of white or gray at the termination for circuits of less than 50 volts shall be required to be grounded only in accordance with 250.20(A).\n\n(C) Circuits of 50 Volts or More\n\nThe use of insulation that is white or gray or that has three continuous white or gray stripes for other than a grounded conductor for circuits of 50 volts or more shall be permitted only as in the following:\n\nIf part of a cable assembly that has the insulation permanently reidentified to indicate its use as an ungrounded conductor by marking tape, painting, or other effective means at its termination and at each location where the conductor is visible and accessible. Identification shall encircle the insulation and shall be a color other than white, gray, or green. If used for single-pole, 3-way or 4-way switch loops, the reidentified conductor with white or gray insulation or three continuous white or gray stripes shall be used only for the supply to the switch, but not as a return conductor from the switch to the outlet.\n\nA flexible cord having one conductor identified by a white or gray outer finish or three continuous white or gray stripes, or by any other means in accordance with 400.22, that is used for connecting an appliance or equipment in accordance with 400.10. This shall apply to flexible cords connected to outlets whether or not the outlet is supplied by a circuit that has a grounded conductor.\n\nInformational Note: The color gray may have been used in the past as an ungrounded conductor. Care should be taken when working on existing systems.",
    "audio": "https://drive.google.com/file/d/1kQ_GBVjl2fSqj7aUsWpAmPcPSaJVnpId/view?usp=drive_link"
  },
  "4": {
    "content": "200.9 Means of Identification of Terminals\n\nIn devices or utilization equipment with polarized connections, identification of terminals to which a grounded conductor is to be connected shall be white or silver in color. The identification of other terminals shall be of a distinguishable different color.\n\nException: If the conditions of maintenance and supervision ensure that only qualified persons service the installations, terminals for grounded conductors shall be permitted to be permanently identified at the time of installation by a distinctive white marking or other equally effective means.\n\n200.10 Identification of Terminals\n\n(A) Device Terminals\n\nAll devices, excluding panelboards, provided with terminals for the attachment of conductors and intended for connection to more than one side of the circuit shall have terminals marked for identification, unless the electrical connection of the terminal intended to be connected to the grounded conductor is clearly evident.\n\nException: Terminal identification shall not be required for devices that have a current rating of over 30 amperes, other than polarized attachment plugs and polarized receptacles for attachment plugs in accordance with 200.10(B).\n\n(B) Receptacles, Plugs, and Connectors\n\nReceptacles, polarized attachment plugs, and cord connectors for plugs and polarized plugs shall have the terminal intended for connection to the grounded conductor identified as follows:\n\nIdentification shall be by a metal or metal coating that is white or silver in color or by the word \"white\" or the letter \"W\" located adjacent to the identified terminal.\nIf the terminal is not visible, the conductor entrance hole for the connection shall be colored white or marked with the word \"white\" or the letter \"W.\"\nInformational Note: See 250.126 for identification of wiring device equipment grounding conductor terminals.\n\n(C) Screw Shells\n\nFor devices with screw shells, the terminal for the grounded conductor shall be the one connected to the screw shell.\n\n(D) Screw Shell Devices With Leads\n\nFor screw shell devices with attached leads, the conductor attached to the screw shell shall have a white or gray finish. The outer finish of the other conductor shall be of a solid color that will not be confused with the white or gray finish used to identify the grounded conductor.\n\nInformational Note: The color gray may have been used in the past as an ungrounded conductor. Caution should be taken when working on existing systems.\n\n(E) Appliances\n\nAppliances that have a single-pole switch or a single-pole overcurrent device in the line or any line-connected screw shell lampholders, and that are to be connected by (1) a permanent wiring method or (2) field-installed attachment plugs and cords with three or more wires (including the equipment grounding conductor), shall have means to identify the terminal for the grounded circuit conductor (if any).\n\n200.11 Polarity of Connections\n\nNo grounded conductor shall be attached to any terminal or lead so as to reverse the designated polarity.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "5": {
    "content": "Article 210 Branch Circuits Not Over 1000 Volts AC, 1500 Volts DC, Nominal\n\nPart I General\n\n210.1 Scope\n\nThis article provides the general requirements for branch circuits not over 1000 volts ac, 1500 volts dc, nominal.\n\nInformational Note: See Part II of Article 235 for requirements for branch circuits over 1000 volts ac, 1500 volts dc, nominal.\n\n210.2 Reconditioned Equipment\n\nThe following shall not be reconditioned:\n\nEquipment that provides ground-fault circuit-interrupter protection for personnel\nEquipment that provides arc-fault circuit-interrupter protection\n\n210.3 Other Articles for Specific-Purpose Branch Circuits\n\nTable 210.3 lists references for specific equipment and applications not located in Chapters 5, 6, and 7 that amend or supplement the requirements of this article.\n\nTable 210.3 Specific-Purpose Branch Circuits\n\nEquipment\n\nArticle\n\nSection\n\nAir-conditioning and refrigerating equipment\n\n440.6, 440.31, and 440.32\n\nBusways\n\n368.17\n\nCentral heating equipment other than fixed electric space-heating equipment\n\n422.12\n\nFixed electric heating-equipment for pipelines and vessels\n\n427.4\n\nFixed electric space-heating equipment\n\n424.4\n\nFixed outdoor electrical deicing and snow-melting equipment\n\n426.4\n\nInfrared lamp industrial heating equipment\n\n422.48 and 424.3\n\nMotors, motor circuits, and controllers\n\n430\n\nSwitchboards and panelboards\n\n408.52\n\n210.4 Multiwire Branch Circuits\n\n(A) General\n\nBranch circuits recognized by this article shall be permitted as multiwire circuits. A multiwire circuit shall be permitted to be considered as multiple circuits. Except as permitted in 300.3(B)(4), all conductors of a multiwire branch circuit shall originate from the equipment containing the branch-circuit overcurrent protective device or protective devices.\n\nInformational Note No. 1: A 3-phase, 4-wire, wye-connected power system used to supply power to nonlinear loads might necessitate that the power system design allow for the possibility of high harmonic currents on the neutral conductor.\n\nInformational Note No. 2: See 300.13(B) for continuity of grounded conductors on multiwire circuits.\n\n(B) Disconnecting Means\n\nEach multiwire branch circuit shall be provided with a means that will simultaneously disconnect all ungrounded conductors at the point where the branch circuit originates.\n\nInformational Note: See 240.15(B) for information on the use of single-pole circuit breakers as the disconnecting means.\n\n(C) Line-to-Neutral Loads\n\nMultiwire branch circuits shall supply only line-to-neutral loads.\n\nException No. 1: A multiwire branch circuit that supplies only one utilization equipment shall be permitted to supply line-to-line loads.\n\nException No. 2: A multiwire branch circuit shall be permitted to supply line-to-line loads if all ungrounded conductors of the multiwire branch circuit are opened simultaneously by the branch-circuit overcurrent device.\n\n(D) Grouping\n\nThe ungrounded and grounded circuit conductors of each multiwire branch circuit shall be grouped in accordance with 200.4(B).",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "6": {
    "content": "210.5 Identification for Branch Circuits\n\n(A) Grounded Conductor\n\nThe grounded conductor of a branch circuit shall be identified in accordance with 200.6.\n\n(B) Equipment Grounding Conductor\n\nThe equipment grounding conductor shall be identified in accordance with 250.119.\n\n(C) Identification of Ungrounded Conductors\n\nUngrounded conductors shall be identified in accordance with 210.5(C)(1) or (2), as applicable.\n\n(1) Branch Circuits Supplied From More Than One Nominal Voltage System\n\nWhere the premises wiring system has branch circuits supplied from more than one nominal voltage system, each ungrounded conductor of a branch circuit shall be identified by phase or line and by nominal voltage system at all termination, connection, and splice points in accordance with 210.5(C)(1)(a) and (C)(1)(b). Different systems within the same premises that have the same nominal voltage shall be permitted to use the same identification.\n\n(a) Means of Identification. The means of identification shall be permitted to be by separate color coding, marking tape, tagging, or other approved means.\n\n(b) Posting of Identification Means. The method used for conductors originating within each branch-circuit panelboard or similar branch-circuit distribution equipment shall be documented in a manner that is readily available or shall be permanently posted at each branch-circuit panelboard or similar branch-circuit distribution equipment. The label shall be of sufficient durability to withstand the environment involved and shall not be handwritten.\n\nException: In existing installations where a voltage system(s) already exists and a different voltage system is being added, it shall be permissible to mark only the new system voltage. Existing unidentified systems shall not be required to be identified at each termination, connection, and splice point in accordance with 210.5(C)(1)(a) and (C)(1)(b). Labeling shall be required at each voltage system distribution equipment to identify that only one voltage system has been marked for a new system(s). The new system label(s) shall include the words \"other unidentified systems exist on the premises.\"\n\n(2) Branch Circuits Supplied From Direct-Current Systems\n\nWhere a branch circuit is supplied from a dc system operating at more than 60 volts, each ungrounded conductor of 4 AWG or larger shall be identified by polarity at all termination, connection, and splice points by marking tape, tagging, or other approved means; each ungrounded conductor of 6 AWG or smaller shall be identified by polarity at all termination, connection, and splice points in compliance with 210.5(C)(2)(a) and (b). The identification methods utilized for conductors originating within each branch-circuit panelboard or similar branch-circuit distribution equipment shall be documented in a manner that is readily available or shall be permanently posted at each branch-circuit panelboard or similar branch-circuit distribution equipment.\n\n(a) Positive Polarity, Sizes 6 AWG or Smaller. Where the positive polarity of a dc system does not serve as the connection point for the grounded conductor, each positive ungrounded conductor shall be identified by one of the following means:\n\n- A continuous red outer finish\n- A continuous red stripe durably marked along the conductor's entire length on insulation of a color other than green, white, gray, or black\n- Imprinted plus signs (+) or the word POSITIVE or POS durably marked on insulation of a color other than green, white, gray, or black and repeated at intervals not exceeding 610 mm (24 in.) in accordance with 310.8(B)\n- An approved permanent marking means such as sleeving or shrink-tubing that is suitable for the conductor size, at all termination, connection, and splice points, with imprinted plus signs (+) or the word POSITIVE or POS durably marked on insulation of a color other than green, white, gray, or black\n\n(b) Negative Polarity, Sizes 6 AWG or Smaller. Where the negative polarity of a dc system does not serve as the connection point for the grounded conductor, each negative ungrounded conductor shall be identified by one of the following means:\n\n- A continuous black outer finish\n- A continuous black stripe durably marked along the conductor's entire length on insulation of a color other than green, white, gray, or red\n- Imprinted minus signs (—) or the word NEGATIVE or NEG durably marked on insulation of a color other than green, white, gray, or red and repeated at intervals not exceeding 610 mm (24 in.) in accordance with 310.8(B)\n- An approved permanent marking means such as sleeving or shrink-tubing that is suitable for the conductor size, at all termination, connection, and splice points, with imprinted minus signs (—) or the word NEGATIVE or NEG durably marked on insulation of a color other than green, white, gray, or red",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "7": {
    "content": "210.6 Branch-Circuit Voltage Limitations\n\nThe nominal voltage of branch circuits shall not exceed the values permitted by 210.6(A) through (D).\n\n(A) Occupancy Limitation\n\nIn dwelling units and guest rooms or guest suites of hotels, motels, and similar occupancies, the voltage shall not exceed 120 volts, nominal, between conductors that supply the terminals of the following:\n\n- Luminaires\n- Cord-and-plug-connected loads 1440 volt-amperes, nominal, or less or less than 1/4 hp\n\n(B) 120 Volts Between Conductors\n\nCircuits not exceeding 120 volts, nominal, between conductors shall be permitted to supply the following:\n\n- The terminals of lampholders applied within their voltage ratings\n- Auxiliary equipment of electric-discharge lamps\n  Informational Note: See 410.137 for auxiliary equipment limitations.\n- Cord-and-plug-connected or permanently connected utilization equipment\n\n(C) 277 Volts to Ground\n\nCircuits exceeding 120 volts, nominal, between conductors and not exceeding 277 volts, nominal, to ground shall be permitted to supply cord-and-plug-connected or permanently connected utilization equipment, or the following types of listed luminaires:\n\n1. Electric-discharge luminaires with integral ballasts\n2. LED luminaires with LED drivers between the branch circuit and the lampholders\n3. Incandescent or LED luminaires, equipped with medium-base or smaller screw shell lampholders, where the lampholders are supplied at 120 volts or less from the output of a stepdown autotransformer, LED driver, or other type of power supply that is an integral component of the luminaire\n  Informational Note No. 1: See 410.90 for requirements regarding the connection of screw shell lampholders to grounded conductors.\n4. Luminaires equipped with mogul-base screw shell lampholders\n5. Luminaires equipped with lampholders, other than the screw shell type, when used within the voltage ratings of their lampholders\n6. Luminaires without lampholders\n  Informational Note No. 2: Luminaires with nonserviceable LEDs are examples of luminaires without lampholders.\n7. Auxiliary equipment of electric-discharge or LED-type lamps\n  Informational Note No. 3: See 410.137 for auxiliary equipment limitations.\n8. Luminaires converted with listed retrofit kits incorporating integral LED light sources or accepting LED lamps that also conform with 210.6(C)(1), (C)(2), (C)(3), (C)(4), or (C)(5)\n\n(D) 1000 Volts AC or 1500 Volts DC Between Conductors\n\nCircuits exceeding 277 volts, nominal, to ground and not exceeding 1000 volts ac or 1500 volts dc, nominal, between conductors shall be permitted to supply the following:\n\n1. The auxiliary equipment of electric-discharge lamps mounted in permanently installed luminaires where the luminaires are mounted in accordance with one of the following:\n   - Not less than a height of 6.7 m (22 ft) on poles or similar structures for the illumination of outdoor areas such as highways, roads, bridges, athletic fields, or parking lots\n   - Not less than a height of 5.5 m (18 ft) on other structures such as tunnels\n   Informational Note: See 410.137 for auxiliary equipment limitations.\n2. Cord-and-plug-connected or permanently connected utilization equipment other than luminaires\n3. Luminaires powered from direct-current systems where either of the following apply:\n   - The luminaire contains a listed, dc-rated ballast that provides isolation between the dc power source and the lamp circuit and protection from electric shock when changing lamps.\n   - The luminaire contains a listed, dc-rated ballast and has no provision for changing lamps.\n\nException No. 1 to (B), (C), and (D): For lampholders of infrared industrial heating appliances as provided in 425.14.\n\nException No. 2 to (B), (C), and (D): For railway properties as described in 110.19.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "8": {
    "content": "210.7 Multiple Branch Circuits\n\nIf two or more branch circuits supply devices or equipment on the same yoke or mounting strap, a means to simultaneously disconnect the ungrounded supply conductors shall be provided at the point at which the branch circuits originate.\n\n210.8 Ground-Fault Circuit-Interrupter Protection for Personnel\n\nA listed Class A GFCI shall provide protection in accordance with 210.8(A) through (F). The GFCI shall be installed in a readily accessible location.\n\nInformational Note: See 215.9 for GFCI protection on feeders.\n\nFor the purposes of this section, the distance from receptacles shall be measured as the shortest path the power supply cord connected to the receptacle would follow without piercing a floor, wall, ceiling, or fixed barrier.\n\n(A) Dwelling Units\n\nAll 125-volt through 250-volt receptacles installed in the following locations and supplied by single-phase branch circuits rated 150 volts or less to ground shall have ground-fault circuit-interrupter protection for personnel:\n\nBathrooms\nGarages and also accessory buildings that have a floor located at or below grade level not intended as habitable rooms and limited to storage areas, work areas, and areas of similar use\nOutdoors\nCrawl spaces - at or below grade level\nBasements\nKitchens\nAreas with sinks and permanent provisions for food preparation, beverage preparation, or cooking\nSinks - where receptacles are installed within 1.8 m (6 ft) from the top inside edge of the bowl of the sink\nBoathouses\nBathtubs or shower stalls - where receptacles are installed within 1.8 m (6 ft) of the outside edge of the bathtub or shower stall\nLaundry areas\nIndoor damp and wet locations\n\nException No. 1: Receptacles that are not readily accessible and are supplied by a branch circuit dedicated to electric snow-melting, deicing, or pipeline and vessel heating equipment shall be permitted to be installed in accordance with 426.28 or 427.22, as applicable.\n\nException No. 2: A receptacle supplying only a permanently installed premises security system shall be permitted to omit ground-fault circuit-interrupter protection.\n\nException No. 3: Listed weight-supporting ceiling receptacles (WSCR) utilized in combination with compatible weight-supporting attachment fittings (WSAF) installed for the purpose of supporting a ceiling luminaire or ceiling-suspended fan shall be permitted to omit ground-fault circuit-interrupter protection. If a general-purpose convenience receptacle is integral to the ceiling luminaire or ceiling-suspended fan, GFCI protection shall be provided.\n\nException No. 4: Factory-installed receptacles that are not readily accessible and are mounted internally to bathroom exhaust fan assemblies shall not require GFCI protection unless required by the installation instructions or listing.\n\nInformational Note: See 760.41(B) and 760.121(B) for power supply requirements for fire alarm systems.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "9": {
    "content": "(B) Other Than Dwelling Units\n\nAll 125-volt through 250-volt receptacles supplied by single-phase branch circuits rated 150 volts or less to ground, 50 amperes or less, and all receptacles supplied by three-phase branch circuits rated 150 volts or less to ground, 100 amperes or less, installed in the following locations shall be provided with GFCI protection:\n\nBathrooms\nKitchens\nAreas with sinks and permanent provisions for food preparation, beverage preparation, or cooking\nBuffet serving areas with permanent provisions for food serving, beverage serving, or cooking\nRooftops\nOutdoors\nSinks where receptacles or cord-and-plug-connected fixed or stationary appliances are installed within 1.8 m (6 ft) from the top inside edge of the bowl of the sink\nIndoor damp or wet locations\nLocker rooms with associated showering facilities\nGarages, accessory buildings, service bays, and similar areas other than vehicle exhibition halls and showrooms\nCrawl spaces at or below grade level\nUnfinished areas of basements\nAquariums, bait wells, and similar open aquatic vessels or containers, such as tanks or bowls, where receptacles are installed within 1.8 m (6 ft) from the top inside edge or rim or from the conductive support framing of the vessel or container\nLaundry areas\nBathtubs and shower stalls where receptacles are installed within 1.8 m (6 ft) of the outside edge of the bathtub or shower stall\n\nException No. 1: Receptacles that are not readily accessible and are supplied by a branch circuit dedicated to electric snow-melting, deicing, or pipeline and vessel heating equipment shall be permitted to be installed in accordance with 426.28 or 427.22, as applicable.\n\nException No. 2: Receptacles on rooftops shall not be required to be readily accessible other than from the rooftop.\n\nException No. 3: Receptacles or cord-and-plug-connected fixed and stationary appliances installed within 1.8 m (6 ft) from the top inside edge of a bowl of a sink shall not be required to be GFCI protected in industrial establishments where the conditions of maintenance and supervision ensure that only qualified personnel are involved, an assured equipment grounding conductor program in accordance with 590.6(B)(2) shall be permitted for only those receptacle outlets used to supply equipment that would create a greater hazard if power is interrupted or that has a design not compatible with GFCI protection.\n\nException No. 4: Receptacles or cord-and-plug-connected fixed and stationary appliances installed within 1.8 m (6 ft) from the top inside edge of a bowl of a sink shall not be required to be GFCI protected in industrial laboratories where the receptacles are used to supply equipment if removal of power would introduce a greater hazard.\n\nException No. 5: Receptacles located in patient bed locations of Category 2 (general care) or Category 1 (critical care) spaces of health care facilities shall be permitted to comply with 517.21.\n\nException No. 6: Listed weight-supporting ceiling receptacles (WSCR) utilized in combination with compatible weight-supporting attachment fittings (WSAF) installed for the purpose of serving a ceiling luminaire or ceiling-suspended fan shall be permitted to omit GFCI protection. If a general-purpose convenience receptacle is integral to the ceiling luminaire or ceiling-suspended fan, GFCI protection shall be provided.\n\n(C) Crawl Space Lighting Outlets\n\nGFCI protection shall be provided for lighting outlets not exceeding 120 volts installed in crawl spaces.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "10": {
    "content": "(D) Specific Appliances\n\nGFCI protection shall be provided for the branch circuit or outlet supplying the following appliances rated 150 volts or less to ground and 60 amperes or less, single- or 3-phase:\n\nAutomotive vacuum machines\nDrinking water coolers and bottle fill stations\nHigh-pressure spray washing machines\nTire inflation machines\nVending machines\nSump pumps\nDishwashers\nElectric ranges\nWall-mounted ovens\nCounter-mounted cooking units\nClothes dryers\nMicrowave ovens\n\n(E) Equipment Requiring Servicing\n\nGFCI protection shall be provided for the receptacles required by 210.63.\n\n(F) Outdoor Outlets\n\nFor dwellings, all outdoor outlets, other than those covered in 210.8(A), Exception No. 1, including outlets installed in the following locations, and supplied by single-phase branch circuits rated 150 volts or less to ground, 50 amperes or less, shall be provided with GFCI protection:\n\nGarages that have floors located at or below grade level\nAccessory buildings\nBoathouses\n\nIf equipment supplied by an outlet covered under the requirements of this section is replaced, the outlet shall be supplied with GFCI protection.\n\nException No. 1: GFCI protection shall not be required on lighting outlets other than those covered in 210.8(C).\n\nException No. 2: GFCI protection shall not be required for listed HVAC equipment. This exception shall expire September 1, 2026.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "11": {
    "content": "210.9 Circuits Derived From Autotransformers\n\nBranch circuits shall not be derived from autotransformers unless the circuit supplied has a grounded conductor that is electrically connected to a grounded conductor of the system supplying the autotransformer.\n\nException No. 1: An autotransformer shall be permitted without the connection to a grounded conductor where transforming from a nominal 208 volts to a nominal 240-volt supply or similarly from 240 volts to 208 volts.\n\nException No. 2: In industrial occupancies, where conditions of maintenance and supervision ensure that only qualified persons service the installation, autotransformers shall be permitted to supply nominal 600-volt loads from nominal 480-volt systems, and 480-volt loads from nominal 600-volt systems, without the connection to a similar grounded conductor.\n\n210.10 Ungrounded Conductors Tapped From Grounded Systems\n\nTwo-wire dc circuits and ac circuits of two or more ungrounded conductors shall be permitted to be tapped from the ungrounded conductors of circuits that have a grounded neutral conductor. Switching devices in each tapped circuit shall have a pole in each ungrounded conductor. All poles of multipole switching devices shall manually switch together where such switching devices also serve as a disconnecting means as required by the following:\n\n410.93 for double-pole switched lampholders\n410.104(B) for electric-discharge lamp auxiliary equipment switching devices\n422.31(B) for an appliance\n424.20 for a fixed electric space-heating unit\n426.51 for electric deicing and snow-melting equipment\n430.85 for a motor controller\n430.103 for a motor",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "12": {
    "content": "210.11 Branch Circuits Required\n\nBranch circuits for lighting and for appliances, including motor-operated appliances, shall be provided to supply the loads calculated in accordance with 220.10. In addition, branch circuits shall be provided for specific loads not covered by 220.10 where required elsewhere in this Code and for dwelling unit loads as specified in 210.11(C).\n\n(A) Number of Branch Circuits\n\nThe minimum number of branch circuits shall be determined from the total calculated load and the size or rating of the circuits used. In all installations, the number of circuits shall be sufficient to supply the load served. In no case shall the load on any circuit exceed the maximum specified by 220.11.\n\n(B) Load Evenly Proportioned Among Branch Circuits\n\nWhere the load is calculated on the basis of volt-amperes per square meter or per square foot, the wiring system up to and including the branch-circuit panelboard(s) shall be provided to serve not less than the calculated load. This load shall be evenly proportioned among multioutlet branch circuits within the panelboard(s). Branch-circuit overcurrent devices and circuits shall be required to be installed only to serve the connected load.\n\n(C) Dwelling Units\n\n(1) Small-Appliance Branch Circuits\n\nIn addition to the number of branch circuits required by other parts of this section, two or more 20-ampere small-appliance branch circuits shall be provided for all receptacle outlets specified by 210.52(B).\n\n(2) Laundry Branch Circuits\n\nIn addition to the number of branch circuits required by other parts of this section, at least one additional 20-ampere branch circuit shall be provided to supply the laundry receptacle outlet(s) required by 210.52(F). This circuit shall have no other outlets.\n\n(3) Bathroom Branch Circuits\n\nIn addition to the number of branch circuits required by other parts of this section, one or more 120-volt, 20-ampere branch circuit shall be provided to supply bathroom(s) receptacle outlet(s) required by 210.52(D) and any countertop and similar work surface receptacle outlets. Such circuits shall have no other outlets.\n\nException: Where the 20-ampere circuit supplies a single bathroom, outlets for other equipment within the same bathroom shall be permitted to be supplied in accordance with 210.23(B)(1) and (B)(2).\n\n(4) Garage Branch Circuits\n\nIn addition to the number of branch circuits required by other parts of this section, at least one 120-volt, 20-ampere branch circuit shall be installed to supply receptacle outlets, including those required by 210.52(G)(1) for attached garages and in detached garages with electric power. This circuit shall have no other outlets.\n\nAdditional branch circuits rated 15 amperes or greater shall be permitted to serve receptacle outlets other than those required by 210.52(G)(1).\n\nException No. 1: This circuit shall be permitted to supply outdoor receptacle outlets.\n\nException No. 2: Where the 20-ampere circuit supplies a single vehicle bay garage, outlets for other equipment within the same garage shall be permitted to be supplied in accordance with 210.23(B)(1) and (B)(2).",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "13": {
    "content": "210.12 Arc-Fault Circuit-Interrupter Protection\n\nArc-fault circuit-interrupter (AFCI) protection shall be installed in accordance with 210.12(B) through (E) by any of the means described in 210.12(A)(1) through (A)(6). The AFCI shall be listed and installed in a readily accessible location.\n\n(A) Means of Protection\n\nAFCI protection shall be provided by any of the following means:\n\n1. A listed combination-type AFCI installed to provide protection of the entire branch circuit.\n2. A listed branch/feeder-type AFCI installed at the origin of the branch circuit in combination with a listed outlet branch-circuit-type AFCI installed on the branch circuit at the first outlet box, which shall be marked to indicate that it is the first outlet of the branch circuit.\n3. A listed supplemental arc protection circuit breaker installed at the origin of the branch circuit in combination with a listed outlet branch-circuit-type AFCI installed on the branch circuit at the first outlet box if all of the following conditions are met:\n   - The branch-circuit wiring shall be continuous from the branch-circuit overcurrent device to the outlet branch-circuit AFCI.\n   - The maximum length of the branch-circuit wiring from the branch-circuit overcurrent device to the first outlet shall not exceed 15.2 m (50 ft) for a 14 AWG conductor or 21.3 m (70 ft) for a 12 AWG conductor.\n   - The first outlet box shall be marked to indicate that it is the first outlet of the branch circuit.\n4. A listed outlet branch-circuit-type AFCI installed on the branch circuit at the first outlet in combination with a listed branch-circuit overcurrent protective device if all of the following conditions are met:\n   - The branch-circuit wiring shall be continuous from the branch-circuit overcurrent device to the outlet branch-circuit AFCI.\n   - The maximum length of the branch-circuit wiring from the branch-circuit overcurrent device to the first outlet shall not exceed 15.2 m (50 ft) for a 14 AWG conductor or 21.3 m (70 ft) for a 12 AWG conductor.\n   - The first outlet box shall be marked to indicate that it is the first outlet of the branch circuit.\n   - The combination of the branch-circuit overcurrent device and outlet branch-circuit AFCI shall be identified as meeting the requirements for a system combination-type AFCI and listed as such.\n5. If metal raceway, metal wireways, metal auxiliary gutters, or Type MC or Type AC cable meeting the applicable requirements of 250.118, with metal boxes, metal conduit bodies, and metal enclosures are installed for the portion of the branch circuit between the branch-circuit overcurrent device and the first outlet, it shall be permitted to install a listed outlet branch-circuit-type AFCI at the first outlet to provide protection for the remaining portion of the branch circuit.\n6. Where a listed metal or nonmetallic conduit or tubing or Type MC cable is encased in not less than 50 mm (2 in.) of concrete for the portion of the branch circuit between the branch-circuit overcurrent device and the first outlet, it shall be permitted to install a listed outlet branch-circuit-type AFCI at the first outlet to provide protection for the remaining portion of the branch circuit.\n\nInformational Note: See UL 1699-2011, Standard for Arc-Fault Circuit-Interrupters, for information on combination-type and branch/feeder-type AFCI devices. See UL Subject 1699A, Outline of Investigation for Outlet Branch Circuit Arc-Fault Circuit-Interrupters, for information on outlet branch-circuit type AFCI devices. See UL Subject 1699C, Outline of Investigation for System Combination Arc-Fault Circuit Interrupters, for information on system combination AFCIs.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "14": {
    "content": "210.12(B) Dwelling Units\n\nAll 120-volt, single-phase, 10-, 15-, and 20-ampere branch circuits supplying outlets or devices installed in the following locations shall be protected by any of the means described in 210.12(A)(1) through (A)(6):\n\n- Kitchens\n- Family rooms\n- Dining rooms\n- Living rooms\n- Parlors\n- Libraries\n- Dens\n- Bedrooms\n- Sunrooms\n- Recreation rooms\n- Closets\n- Hallways\n- Laundry areas\n- Similar areas\n\nException No. 1: AFCI protection shall not be required for an individual branch circuit supplying a fire alarm system installed in accordance with 760.41(B) or 760.121(B). The branch circuit shall be installed in a metal raceway, metal auxiliary gutter, steel-armored cable, or Type MC or Type AC cable meeting the applicable requirements of 250.118, with metal boxes, conduit bodies, and enclosures.\n\nException No. 2: AFCI protection shall not be required for the individual branch circuit supplying an outlet for arc welding equipment in a dwelling unit until January 1, 2025.\n\nInformational Note No. 1: See NFPA 72-2022, National Fire Alarm and Signaling Code, 29.9.4(5), for information on secondary power source requirements for smoke alarms installed in dwelling units.\n\nInformational Note No. 2: See 760.41(B) and 760.121(B) for power source requirements for fire alarm systems.\n\n210.12(C) Dormitory Units\n\nAll 120-volt, single-phase, 10-, 15-, and 20-ampere branch circuits supplying outlets or devices installed in the following locations shall be protected by any of the means described in 210.12(A)(1) through (A)(6):\n\n- Bedrooms\n- Living rooms\n- Hallways\n- Closets\n- Bathrooms\n- Similar rooms\n\n210.12(D) Other Occupancies\n\nAll 120-volt, single-phase, 10-, 15-, and 20-ampere branch circuits supplying outlets or devices installed in the following locations shall be protected by any of the means described in 210.12(A)(1) through (A)(6):\n\n- Guest rooms and guest suites of hotels and motels\n- Areas used exclusively as patient sleeping rooms in nursing homes and limited-care facilities\n- Areas designed for use exclusively as sleeping quarters in fire stations, police stations, ambulance stations, rescue stations, ranger stations, and similar locations\n\n210.12(E) Branch Circuit Wiring Extensions, Modifications, or Replacements\n\nIf branch-circuit wiring for any of the areas specified in 210.12(B), (C), or (D) is modified, replaced, or extended, the branch circuit shall be protected by one of the following:\n\n- By any of the means described in 210.12(A)(1) through (A)(6)\n- A listed outlet branch-circuit-type AFCI located at the first receptacle outlet of the existing branch circuit\n\nException: AFCI protection shall not be required where the extension of the existing branch-circuit conductors is not more than 1.8 m (6 ft) and does not include any additional outlets or devices, other than splicing devices. This measurement shall not include the conductors inside an enclosure, cabinet, or junction box.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "15": {
    "content": "210.13 Ground-Fault Protection of Equipment\n\nEach branch-circuit disconnecting means rated 1000 amperes or more and installed on solidly grounded wye electrical systems of more than 150 volts to ground, but not exceeding 1000 volts phase-to-phase, shall be provided with ground-fault protection of equipment in accordance with 230.95.\n\nInformational Note: See 517.17 for requirements on buildings that contain health care occupancies.\n\nException No. 1: This section shall not apply to a disconnecting means for a continuous industrial process where a nonorderly shutdown will introduce additional or increased hazards.\n\nException No. 2: This section shall not apply if ground-fault protection of equipment is provided on the supply side of the branch circuit and on the load side of any transformer supplying the branch circuit.\n\n210.17 Guest Rooms and Guest Suites\n\nGuest rooms and guest suites in the following occupancies that are provided with permanent provisions for cooking shall have branch circuits installed to meet the rules for dwelling units:\n\n- Hotels\n- Motels\n- Assisted living facilities\n\nInformational Note No. 1: See 210.11(C)(2) and 210.52(F), Exception No. 2, for information on laundry branch circuits and receptacle outlets.\n\nInformational Note No. 2: See NFPA 101-2021, Life Safety Code, 3.3.198.12 and A.3.3.198.12(5), for the definition of assisted living facilities.\n\n210.18 Rating\n\nBranch circuits recognized by this article shall be rated in accordance with the maximum permitted ampere rating or setting of the overcurrent device. The rating for other than individual branch circuits shall be 10, 15, 20, 30, 40, and 50 amperes. Where conductors of higher ampacity are used for any reason, the ampere rating or setting of the specified overcurrent device shall determine the circuit rating.\n\nException No. 1: Multioutlet branch circuits greater than 50 amperes shall be permitted to supply nonlighting outlet loads in locations where conditions of maintenance and supervision ensure that only qualified persons service the equipment.\n\nException No. 2: Branch circuits rated 10 amperes shall not supply receptacle outlets.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "16": {
    "content": "210.19 Conductors - Minimum Ampacity and Size\n\nBranch-circuit conductors for circuits not exceeding 1000 volts ac or 1500 volts dc shall be sized in accordance with 210.19(A) through (D).\n\nInformational Note: Conductors for branch circuits as defined in Article 100, sized to prevent a voltage drop exceeding 3 percent at the farthest outlet of power, heating, and lighting loads, or combinations of such loads, and where the maximum total voltage drop on both feeders and branch circuits to the farthest outlet does not exceed 5 percent, provide reasonable efficiency of operation. See 215.21(A)(2). Informational Note No. 2, for information on voltage drop on feeder conductors.\n\n(A) General\n\nBranch-circuit conductors shall have an ampacity not less than the larger of the following and comply with 110.14(C) for equipment terminations:\n\n1. Where a branch circuit supplies continuous loads or any combination of continuous and noncontinuous loads, the minimum branch-circuit conductor size shall have an ampacity not less than the noncontinuous load plus 125 percent of the continuous load in accordance with 310.14.\n   Exception to (1): If the assembly, including the overcurrent devices protecting the branch circuits, is listed for operation at 100 percent of its rating, the ampacity of the branch-circuit conductors shall be permitted to be not less than the sum of the continuous load plus the noncontinuous load in accordance with 110.14(C).\n\n2. The minimum branch-circuit conductor size shall have an ampacity not less than the maximum load to be served after the application of any adjustment or correction factors in accordance with 310.15.\n   Exception to (1) and (2): Where a portion of a branch circuit is connected at both its supply and load ends to separately installed pressure connections as covered in 110.14(C)(2), an allowable ampacity in accordance with 310.15 not less than the sum of the continuous load plus the noncontinuous load shall be permitted. No portion of a branch circuit installed under this exception shall extend into an enclosure containing either the branch-circuit supply or the branch-circuit load terminations.\n\n(B) Branch Circuits With More Than One Receptacle\n\nConductors of branch circuits supplying more than one receptacle for cord-and-plug-connected portable loads shall have an ampacity of not less than the rating of the branch circuit.\n\n(C) Household Ranges and Cooking Appliances\n\nBranch-circuit conductors supplying household ranges, wall-mounted ovens, counter-mounted cooking units, and other household cooking appliances shall have an ampacity not less than the rating of the branch circuit and not less than the maximum load to be served. For ranges of 8 3/4 kW or more rating, the minimum branch-circuit rating shall be 40 amperes.\n\nException No. 1: Conductors tapped from a branch circuit not exceeding 50 amperes supplying electric ranges, wall-mounted electric ovens, and counter-mounted electric cooking units shall have an ampacity of not less than 20 amperes and shall be sufficient for the load to be served. These tap conductors include any conductors that are a part of the leads supplied with the appliance that are smaller than the branch-circuit conductors. The taps shall not be longer than necessary for servicing the appliance.\n\nException No. 2: The neutral conductor of a 3-wire branch circuit supplying a household electric range, a wall-mounted oven, or a counter-mounted cooking unit shall be permitted to be smaller than the ungrounded conductors where the maximum demand of a range of 8 3/4 kW or more rating has been calculated according to Column C of Table 220.55, but such conductor shall have an ampacity of not less than 70 percent of the branch-circuit rating and shall not be smaller than 10 AWG.\n\n(D) Other Loads\n\nBranch-circuit conductors that supply loads other than those specified in 210.3 and other than cooking appliances as covered in 210.19(C) shall have an ampacity sufficient for the loads served and shall not be smaller than 14 AWG.\n\nException No. 1: Tap conductors shall have an ampacity sufficient for the load served. In addition, they shall have an ampacity of not less than 15 for circuits rated less than 40 amperes and not less than 20 for circuits rated at 40 or 50 amperes and only where these tap conductors supply any of the following loads:\n\n1. Individual lampholders or luminaires with taps extending not longer than 450 mm (18 in.) beyond any portion of the lampholder or luminaire\n2. A luminaire having tap conductors in accordance with 410.117\n3. Individual outlets, other than receptacle outlets, with taps not over 450 mm (18 in.) long\n4. Infrared lamp industrial heating appliances\n5. Nonheating leads of deicing and snow-melting cables and mats\n\nException No. 2: Fixture wires and flexible cords shall be permitted to be smaller than 14 AWG as permitted by 240.5.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "17": {
    "content": "210.20 Overcurrent Protection\n\nBranch-circuit conductors and equipment for circuits not exceeding 1000 volts ac or 1500 volts dc shall be protected by overcurrent protective devices that have a rating or setting that complies with 210.20(A) through (D).\n\n(A) Continuous and Noncontinuous Loads\n\nWhere a branch circuit supplies continuous loads or any combination of continuous and noncontinuous loads, the rating of the overcurrent device shall not be less than the noncontinuous load plus 125 percent of the continuous load.\n\nException: Where the assembly, including the overcurrent devices protecting the branch circuit(s), is listed for operation at 100 percent of its rating, the ampere rating of the overcurrent device shall be permitted to be not less than the sum of the continuous load plus the noncontinuous load.\n\n(B) Conductor Protection\n\nConductors shall be protected in accordance with 240.4. Flexible cords and fixture wires shall be protected in accordance with 240.5.\n\n(C) Equipment\n\nThe rating or setting of the overcurrent protective device shall not exceed that specified in the applicable articles referenced in Table 240.3 for equipment.\n\n(D) Outlet Devices\n\nThe rating or setting shall not exceed that specified in 210.21 for outlet devices.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "18": {
    "content": "210.21 Outlet Devices\n\nOutlet devices shall have an ampere rating that is not less than the load to be served and shall comply with 210.21(A) and (B).\n\n(A) Lampholders\n\nWhere connected to a branch circuit having a rating in excess of 20 amperes, lampholders shall be of the heavy-duty type. A heavy-duty lampholder shall have a rating of not less than 660 watts if of the medium type, or not less than 750 watts if of any other type.\n\n(B) Receptacles\n\n(1) Single Receptacle on an Individual Branch Circuit\n\nA single receptacle installed on an individual branch circuit shall have an ampere rating not less than that of the branch circuit.\n\nException No. 1: A receptacle installed in accordance with 430.81(B).\n\nException No. 2: A receptacle installed exclusively for the use of a cord-and-plug-connected arc welder shall be permitted to have an ampere rating not less than the minimum branch-circuit conductor ampacity determined by 630.11(A) for arc welders.\n\nInformational Note: See Article 100 for the definition of receptacle.\n\n(2) Total Cord-and-Plug-Connected Load\n\nWhere connected to a branch circuit supplying two or more receptacles or outlets, a receptacle shall not supply a total cord-and-plug-connected load in excess of the maximum specified in Table 210.21(B)(2).\n\nTable 210.21(B)(2) Maximum Cord-and-Plug-Connected Load to Receptacle\n\nCircuit Rating (Amperes) | Receptacle Rating (Amperes) | Maximum Load (Amperes)\n15 or 20 | 15 | 12\n20 | 20 | 16\n30 | 30 | 24\n\n(3) Receptacle Ratings\n\nWhere connected to a branch circuit supplying two or more receptacles or outlets, receptacle ratings shall not be less than the values listed in Table 210.21(B)(3), or, where rated higher than 50 amperes, the receptacle rating shall not be less than the branch-circuit rating.\n\nException No. 1: Receptacles installed exclusively for the use of cord-and-plug-connected arc welders shall be permitted to have ampere ratings not less than the minimum branch-circuit conductor ampacity determined by 630.11(A) or (B) for arc welders.\n\nException No. 2: The ampere rating of a receptacle installed for electric discharge lighting shall be permitted to be based on 410.62(C).\n\nTable 210.21(B)(3) Receptacle Ratings for Circuits Serving More Than One Receptacle or Receptacle Outlet\n\nCircuit Rating (Amperes) | Receptacle Rating (Amperes)\n15 | 15\n20 | 15 or 20\n30 | 30\n40 | 40 or 50\n50 | 50\n\n(4) Range Receptacle Rating\n\nThe ampere rating of a range receptacle shall be permitted to be based on a single range demand load as specified in Table 220.55.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "19": {
    "content": "210.22 Permissible Loads, Individual Branch Circuits\n\nAn individual branch circuit shall be permitted to supply any load for which it is rated, but in no case shall the load exceed the branch-circuit ampere rating.\n\n210.23 Permissible Loads, Multiple-Outlet Branch Circuits\n\nIn no case shall the load exceed the branch-circuit ampere rating. A branch circuit supplying two or more outlets or receptacles shall supply only the loads specified according to its size in accordance with 210.23(A) through (E) and as summarized in 210.24.\n\n(A) 10-Ampere Branch Circuits\n\nA 10-ampere branch circuit shall comply with the requirements of 210.23(A)(1) and (A)(2).\n\n(1) Loads Permitted for 10-Ampere Branch Circuits\n\nA 10-ampere branch circuit shall be permitted to supply one or more of the following:\n\nLighting outlets\nDwelling unit exhaust fans on bathroom or laundry room lighting circuits\nA gas fireplace unit supplied by an individual branch circuit\n\n(2) Loads Not Permitted for 10-Ampere Branch Circuits\n\nA 10-ampere branch circuit shall not supply any of the following:\n\nReceptacle outlets\nFixed appliances, except as permitted for individual branch circuits\nGarage door openers\nLaundry equipment\n\n(B) 15- And 20-Ampere Branch Circuits\n\nA 15- or 20-ampere branch circuit shall be permitted to supply lighting outlets, lighting units, or other utilization equipment, or any combination of them, and shall comply with 210.23(B)(1) and (B)(2).\n\nException: The small-appliance branch circuits, laundry branch circuits, and bathroom branch circuits required in a dwelling unit(s) by 210.11(C)(1), (C)(2), and (C)(3) shall supply only the receptacle outlets specified in that section.\n\n(1) Cord-and-Plug-Connected Equipment Not Fastened in Place\n\nThe rating of any one cord-and-plug-connected utilization equipment not fastened in place shall not exceed 80 percent of the branch-circuit ampere rating.\n\n(2) Utilization Equipment Fastened in Place\n\nThe total rating of utilization equipment fastened in place, other than luminaires, shall not exceed 50 percent of the branch-circuit ampere rating where lighting units, cord-and-plug-connected utilization equipment not fastened in place, or both, are also supplied.\n\n(C) 30-Ampere Branch Circuits\n\nA 30-ampere branch circuit shall be permitted to supply fixed lighting units with heavy-duty lampholders in other than a dwelling unit(s) or utilization equipment in any occupancy. The rating of any one cord-and-plug-connected utilization equipment shall not exceed 80 percent of the branch-circuit ampere rating.\n\n(D) 40- And 50-Ampere Branch Circuits\n\nA 40- or 50-ampere branch circuit shall be permitted to supply cooking appliances that are fastened in place in any occupancy. In other than dwelling units, such circuits shall be permitted to supply fixed lighting units with heavy-duty lampholders, infrared heating units, or other utilization equipment.\n\n(E) Branch Circuits Larger Than 50 Amperes\n\nBranch circuits larger than 50 amperes shall supply only nonlighting outlet loads.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "20": {
    "content": "210.24 Branch-Circuit Requirements - Summary\n\nThe requirements for circuits that have two or more outlets or receptacles, other than the receptacle circuits of 210.11(C)(1), (C)(2), and (C)(3), are summarized in Table 210.24(1) for copper conductors and Table 210.24(2) for aluminum and copper-clad aluminum conductors. Table 210.24(1) and Table 210.24(2) provide only a summary of minimum requirements. See 210.19, 210.20, and 210.21 for the specific requirements applying to branch circuits.\n\nTable 210.24(1) Summary of Branch-Circuit Requirements - Copper Conductors\n\nCircuit Rating\n\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\n\nConductors (min. size):\nCircuit wires\n14\n14\n12\n10\n8\n6\nTaps\n14\n14\n14\n14\n12\n12\nFixture wires and cords\nSee 240.5.\n\nOvercurrent Protection\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\n\nOutlet devices:\nLampholders permitted\nAny type\nAny type\nAny type\nHeavy duty\nHeavy duty\nHeavy duty\nReceptacle rating1\nNot applicable2\n15 max. A\n15 A or 20 A\n30 A\n40 A or 50 A\n50 A\nMaximum Load\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\nPermissible load\nSee 210.23(A)\nSee 210.23(B)\nSee 210.23(B)\nSee 210.23(C)\nSee 210.23(D)\nSee 210.23(D)\n\n1For receptacle rating of cord-connected electric-discharge luminaires, see 410.62(C).\n2Branch circuits rated 10-amperes shall not supply receptacle outlets.\n\nTable 210.24(2) Summary of Branch-Circuit Requirements - Aluminum and Copper-Clad Aluminum Conductors\n\nCircuit Rating\n\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\n\nConductors (min. size):\nCircuit wires\n12\n12\n10\n8\n6\n4\nTaps\n12\n12\n12\n12\n10\n10\nFixture wires and cords\nSee 240.5.\n\nOvercurrent Protection\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\n\nOutlet devices:\nLampholders permitted\nAny type\nAny type\nAny type\nHeavy duty\nHeavy duty\nHeavy duty\nReceptacle rating1\nNot applicable2\n15 max. A\n15 A or 20 A\n30 A\n40 A or 50 A\n50 A\nMaximum Load\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\nPermissible load\nSee 210.23(A)\nSee 210.23(B)\nSee 210.23(B)\nSee 210.23(C)\nSee 210.23(D)\nSee 210.23(D)\n\n1For receptacle rating of cord-connected electric-discharge luminaires, see 410.62(C).\n2Branch circuits rated 10-amperes shall not supply receptacle outlets.\n\n210.25 Branch Circuits in Buildings With More Than One Occupancy\n\n(A) Dwelling Unit Branch Circuits\n\nBranch circuits in each dwelling unit shall supply only loads within that dwelling unit or loads associated only with that dwelling unit.\n\n(B) Common Area Branch Circuits\n\nBranch circuits installed for lighting, central alarm, signal, communications, or other purposes for public or common areas of a two-family dwelling, a multifamily dwelling, or a multi-occupancy building shall not be supplied from equipment that supplies an individual dwelling unit or tenant space.\n\nInformational Note: Examples of public or common areas include, but are not limited to, lobbies, corridors, stairways, laundry rooms, roofs, elevators, washrooms, store rooms, driveways (parking), and mechanical rooms.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "21": {
    "content": "Part III Required Outlets\n\n210.50 Receptacle Outlets\n\nDiagram\n\nReceptacle outlets shall be installed as specified in 210.52 through 210.65.\n\nInformational Note: See Informative Annex J for information regarding ADA accessibility design.\n\n(A) Cord Pendants\n\nA cord connector that is supplied by a permanently connected cord pendant shall be considered a receptacle outlet.\n\n(B) Cord Connections\n\nA receptacle outlet shall be installed wherever flexible cords with attachment plugs are used. Where flexible cords are permitted to be permanently connected, receptacles shall be permitted to be omitted for such cords.\n\n(C) Appliance Receptacle Outlets\n\nAppliance receptacle outlets installed in a dwelling unit for specific appliances, such as laundry equipment, shall be installed within 1.8 m (6 ft) of the intended location of the appliance.\n\n210.52 Dwelling Unit Receptacle Outlets\n\nDiagram\n\nThis section provides requirements for 125-volt, 15- and 20-ampere receptacle outlets. The receptacles required by this section shall be in addition to any receptacle that is as follows:\n\nPart of a luminaire or appliance, or\nControlled by a listed wall-mounted control device in accordance with 210.70(A)(1), Exception No. 1, or\nLocated within cabinets or cupboards, or\nLocated more than 1.7 m (51/2 ft) above the floor\nPermanently installed electric baseboard heaters equipped with factory-installed receptacle outlets or outlets provided as a separate assembly by the manufacturer shall be permitted as the required outlet or outlets for the wall space utilized by such permanently installed heaters. Such receptacle outlets shall not be connected to the heater circuits.\n\nInformational Note: Listed baseboard heaters include instructions that may not permit their installation below receptacle outlets.\n\n(A) General Provisions\n\nIn every kitchen, family room, dining room, living room, parlor, library, den, sunroom, bedroom, recreation room, or similar room or area of dwelling units, receptacle outlets shall be installed in accordance with the general provisions specified in 210.52(A)(1) through (A)(4).\n\n(1) Spacing\n\nReceptacles shall be installed such that no point measured horizontally along the floor line of any wall space is more than 1.8 m (6 ft) from a receptacle outlet.\n\n(2) Wall Space\n\nAs used in this section, a wall space shall include the following:\n\nAny space 600 mm (2 ft) or more in width (including space measured around corners) and unbroken along the floor line by doorways and similar openings, fireplaces, stationary appliances, and fixed cabinets that do not have countertops or similar work surfaces\nThe space occupied by fixed panels in walls, excluding sliding panels\nThe space afforded by fixed room dividers, such as freestanding bar-type counters or railings\n\n(3) Floor Receptacles\n\nReceptacle outlets in or on floors shall not be counted as part of the required number of receptacle outlets unless located within 450 mm (18 in.) of the wall.\n\n(4) Countertop and Similar Work Surface Receptacle Outlets\n\nReceptacles installed for countertop and similar work surfaces as specified in 210.52(C) shall not be considered as the receptacle outlets required by 210.52(A).",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "22": {
    "content": "(B) Small Appliances\n\n(1) Receptacle Outlets Served\n\nIn the kitchen, pantry, breakfast room, dining room, or similar area of a dwelling unit, the two or more 20-ampere small-appliance branch circuits required by 210.11(C)(1) shall serve all wall and floor receptacle outlets covered by 210.52(A), all countertop outlets covered by 210.52(C), and receptacle outlets for refrigeration equipment.\n\nException No. 1: In addition to the required receptacles specified by 210.52, switched receptacles supplied from a general-purpose 15- or 20-ampere branch circuit shall be permitted in accordance with 210.70(A)(1), Exception No. 1.\n\nException No. 2: In addition to the required receptacles specified by 210.52, a receptacle outlet to serve a specific appliance shall be permitted to be supplied from an individual branch circuit rated 15 amperes or greater.\n\n(2) No Other Outlets\n\nThe two or more small-appliance branch circuits specified in 210.52(B)(1) shall have no other outlets.\n\nException No. 1: A receptacle installed solely for the electrical supply to and support of an electric clock in any of the rooms specified in 210.52(B)(1) shall be permitted to be served by a small-appliance branch circuit.\n\nException No. 2: Receptacles installed to provide power for supplemental equipment and lighting on gas-fired ranges, ovens, or counter-mounted cooking units shall be permitted to be served by a small-appliance branch circuit.\n\n(3) Kitchen Receptacle Requirements\n\nReceptacles installed in a kitchen to serve countertop surfaces shall be supplied by not fewer than two small-appliance branch circuits, either or both of which shall also be permitted to supply receptacle outlets in the same kitchen and in other rooms specified in 210.52(B)(1). Additional small-appliance branch circuits shall be permitted to supply receptacle outlets in the kitchen and other rooms specified in 210.52(B)(1). No small-appliance branch circuit shall serve more than one kitchen.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "23": {
    "content": "(C) Countertops and Work Surfaces\n\nIn kitchens, pantries, breakfast rooms, dining rooms, and similar areas of dwelling units, receptacle outlets for countertop and work surfaces that are 300 mm (12 in.) or wider shall be installed in accordance with 210.52(C)(1) through (C)(3) and shall not be considered as the receptacle outlets required by 210.52(A).\n\nFor the purposes of this section, where using multioutlet assemblies, each 300 mm (12 in.) of multioutlet assembly containing two or more receptacles installed in individual or continuous lengths shall be considered to be one receptacle outlet.\n\n(1) Wall Spaces\n\nReceptacle outlets shall be installed so that no point along the wall line is more than 600 mm (24 in.) measured horizontally from a receptacle outlet in that space. The location of the receptacles shall be in accordance with 210.52(C)(3).\n\nException No. 1: Receptacle outlets shall not be required directly behind a range, counter-mounted cooking unit, or sink in the installation described in Figure 210.52(C)(1).\n\nException No. 2: Where a required receptacle outlet cannot be installed in the wall areas shown in Figure 210.52(C)(1), the receptacle outlet shall be permitted to be installed as close as practicable to the countertop area to be served. The total number of receptacle outlets serving the countertop shall not be less than the number needed to satisfy 210.52(C)(1). These outlets shall be located in accordance with 210.52(C)(3).\n\n(2) Island and Peninsular Countertops and Work Surfaces\n\nReceptacle outlets, if installed to serve an island or peninsular countertop or work surface, shall be installed in accordance with 210.52(C)(3). If a receptacle outlet is not provided to serve an island or peninsular countertop or work surface, provisions shall be provided at the island or peninsula for future addition of a receptacle outlet to serve the island or peninsular countertop or work surface.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link",
    "img": "placeholder",
    "caption": "FIGURE 210.52(C)(1) Determination of Area Behind a Range, Counter-Mounted Cooking Unit, or Sink."
  },
  "24": {
    "content": "(3) Receptacle Outlet Location\n\nReceptacle outlets shall be located in one or more of the following:\n\nOn or above, but not more than 500 mm (20 in.) above, a countertop or work surface\nIn a countertop using receptacle outlet assemblies listed for use in countertops\nIn a work surface using receptacle outlet assemblies listed for use in work surfaces or listed for use in countertops\nReceptacle outlets rendered not readily accessible by appliances fastened in place, appliance garages, sinks, or rangetops as covered in 210.52(C)(1), Exception No. 1, or appliances occupying assigned spaces shall not be considered as these required outlets.\n\nInformational Note No. 1: See 406.5(E) for installation of receptacles in countertops and 406.5(F) for installation of receptacles in work surfaces. See 380.10 for installation of multioutlet assemblies.\n\nInformational Note No. 2: See Informative Annex J and ANSI/ICC A117.1-2009, Standard on Accessible and Usable Buildings and Facilities, for additional information.\n\n(D) Bathrooms\n\nAt least one receptacle outlet shall be installed in bathrooms within 900 mm (3 ft) of the outside edge of each sink. The receptacle outlet shall be located on a wall or partition that is adjacent to the sink or sink countertop, located on the countertop, or installed on the side or face of the sink cabinet. In no case shall the receptacle be located more than 300 mm (12 in.) below the top of the sink or sink countertop. Receptacle outlet assemblies listed for use in countertops shall be permitted to be installed in the countertop.\n\nInformational Note: See 406.5(E) and 406.5(G) for requirements on installation of receptacles in countertops.\n\n(E) Outdoor Outlets\n\nOutdoor receptacle outlets shall be installed in accordance with 210.52(E)(1) through (E)(3).\n\n(1) One-Family and Two-Family Dwellings\n\nFor a one-family dwelling and each unit of a two-family dwelling that is at grade level, at least one receptacle outlet readily accessible from grade and not more than 2.0 m (61/2 ft) above grade level shall be installed at the front and back of the dwelling.\n\n(2) Multifamily Dwellings\n\nFor each dwelling unit of a multifamily dwelling where the dwelling unit is located at grade level and provided with individual exterior entrance/egress, at least one receptacle outlet readily accessible from grade and not more than 2.0 m (61/2 ft) above grade level shall be installed.\n\n(3) Balconies, Decks, and Porches\n\nDiagram\n\nBalconies, decks, and porches that are within 102 mm (4 in.) horizontally of the dwelling unit shall have at least one receptacle outlet accessible from the balcony, deck, or porch. The receptacle outlet shall not be located more than 2.0 m (61/2 ft) above the balcony, deck, or porch walking surface.\n\n(F) Laundry Areas\n\nIn dwelling units, at least one receptacle outlet shall be installed in areas designated for the installation of laundry equipment.\n\nException No. 1: A receptacle for laundry equipment shall not be required in a dwelling unit of a multifamily building where laundry facilities are provided on the premises for use by all building occupants.\n\nException No. 2: A receptacle for laundry equipment shall not be required in other than one-family dwellings where laundry facilities are not to be installed or permitted.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "25": {
    "content": "(G) Basements, Garages, and Accessory Buildings\n\nFor one- and two-family dwellings, and multifamily dwellings, at least one receptacle outlet shall be installed in the areas specified in 210.52(G)(1) through (G)(3). These receptacles shall be in addition to receptacles required for specific equipment. Receptacles supplying only a permanently installed premises security system shall not be considered as meeting these requirements.\n\n(1) Garages\n\nIn each attached garage and in each detached garage with electric power, at least one receptacle outlet shall be installed in each vehicle bay and not more than 1.7 m (51/2 ft) above the floor.\n\nException: Garage spaces not attached to an individual dwelling unit of a multifamily dwelling shall not require a receptacle outlet in each vehicle bay.\n\n(2) Accessory Buildings\n\nIn each accessory building with electric power.\n\n(3) Basements\n\nIn each separate unfinished portion of a basement.\n\n(H) Hallways\n\nIn dwelling units, hallways of 3.0 m (10 ft) or more in length shall have at least one receptacle outlet.\n\nAs used in this subsection, the hallway length shall be considered the length along the centerline of the hallway without passing through a doorway.\n\n(I) Foyers\n\nFoyers that are not part of a hallway in accordance with 210.52(H) and that have an area that is greater than 5.6 m2 (60 ft2) shall have a receptacle(s) located in each wall space 900 mm (3 ft) or more in width. Doorways, door-side windows that extend to the floor, and similar openings shall not be considered wall space.\n\n210.60 Guest Rooms, Guest Suites, Dormitory Units, and Similar Occupancies\n\n(A) General\n\nGuest rooms or guest suites in hotels or motels, sleeping rooms in dormitory units, and similar occupancies shall have receptacle outlets installed in accordance with 210.52(A) and (D). Guest rooms or guest suites provided with permanent provisions for cooking shall have receptacle outlets installed in accordance with all of the applicable rules in 210.52.\n\n(B) Receptacle Placement\n\nThe total number of receptacle outlets shall not be less than required in 210.52(A). These receptacle outlets shall be permitted to be located conveniently for permanent furniture layout. At least two receptacle outlets shall be readily accessible. Where receptacles are installed behind the bed, the receptacle shall be located to prevent the bed from contacting any attachment plug that may be installed or the receptacle shall be provided with a suitable guard.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "26": {
    "content": "210.62 Show Windows\n\nAt least one 125-volt, single-phase, 15- or 20-ampere-rated receptacle outlet shall be installed within 450 mm (18 in.) of the top of each show window. No point along the top of the window shall be farther than 1.8 m (6 ft) from a receptacle outlet.\n\n210.63 Equipment Requiring Servicing\n\nA 125-volt, single-phase, 15- or 20-ampere-rated receptacle outlet shall be installed at an accessible location within 7.5 m (25 ft) of the equipment as specified in 210.63(A) and (B).\n\nInformational Note: See 210.8(E) for requirements on GFCI protection.\n\n(A) Heating, Air-Conditioning, and Refrigeration Equipment\n\nThe required receptacle outlet shall be located on the same level as the heating, air-conditioning, and refrigeration equipment. The receptacle outlet shall not be connected to the load side of the equipment's branch-circuit disconnecting means.\n\nException: A receptacle outlet shall not be required at one- and two-family dwellings for the service of evaporative coolers.\n\n(B) Other Electrical Equipment\n\nIn other than one- and two-family dwellings, a receptacle outlet shall be located as specified in 210.63(B)(1) and (B)(2).\n\n(1) Indoor Service Equipment\n\nThe required receptacle outlet shall be located within the same room or area as the service equipment.\n\n(2) Indoor Equipment Requiring Dedicated Equipment Spaces\n\nWhere equipment, other than service equipment, requires dedicated equipment space as specified in 110.26(E), the required receptacle outlet shall be located within the same room or area as the electrical equipment and shall not be connected to the load side of the equipment's disconnecting means.\n\n210.65 Meeting Rooms\n\n(A) General\n\nEach meeting room of not more than 93 m2 (1000 ft2) in other than dwelling units shall have outlets for nonlocking-type, 125-volt, 15- or 20-ampere receptacles. The outlets shall be installed in accordance with 210.65(B). Where a room or space is provided with movable partition(s), each room size shall be determined with the partition in the position that results in the smallest size meeting room.\n\nInformational Note No. 1: For the purposes of this section, meeting rooms are typically designed or intended for the gathering of seated occupants for such purposes as conferences, deliberations, or similar purposes, where portable electronic equipment such as computers, projectors, or similar equipment is likely to be used.\n\nInformational Note No. 2: Examples of rooms that are not meeting rooms include auditoriums, schoolrooms, and coffee shops.\n\n(B) Receptacle Outlets Required\n\nThe total number of receptacle outlets, including floor outlets and receptacle outlets in fixed furniture, shall not be less than as determined in 210.65(B)(1) and (B)(2).\n\n(1) Receptacle Outlets in Fixed Walls\n\nThe required number of receptacle outlets shall be determined in accordance with 210.52(A)(1) through (A)(4). These receptacle outlets shall be permitted to be located as determined by the installer, designer, or building owner.\n\n(2) Floor Outlets\n\nA meeting room with any floor dimension that is 3.7 m (12 ft) or greater in any direction and that has a floor area of at least 20 m2 (215 ft2) shall have at least one floor receptacle outlet, or at least one floor outlet to serve a receptacle(s), located at a distance not less than 1.8 m (6 ft) from any fixed wall for each 20 m2 (215 ft2) or fraction thereof.\n\nInformational Note No. 1: See 314.27(B) for requirements on floor boxes used for receptacles located in the floor.\n\nInformational Note No. 2: See 518.1 for requirements on assembly occupancies designed for 100 or more persons.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "27": {
    "content": "210.70 Lighting Outlets Required\n\nLighting outlets shall be installed where specified in 210.70(A), (B), and (C). The switch or wall-mounted control device shall not rely exclusively on a battery unless a means is provided for automatically energizing the lighting outlets upon battery failure.\n\n(A) Dwelling Units\n\nIn dwelling units, lighting outlets shall be installed in accordance with 210.70(A)(1) and (A)(2).\n\n(1) Habitable Rooms, Kitchens, Laundry Areas, and Bathrooms\n\nAt least one lighting outlet controlled by a listed wall-mounted control device shall be installed in every habitable room, kitchen, laundry area, and bathroom. The wall-mounted control device shall be located near an entrance to the room on a wall.\n\nException No. 1: In other than kitchens, laundry areas, and bathrooms, one or more receptacles controlled by a listed wall-mounted control device shall be permitted in lieu of lighting outlets.\n\nException No. 2: Lighting outlets shall be permitted to be controlled by occupancy sensors that are (1) in addition to listed wall-mounted control devices or (2) located at a customary wall switch location and equipped with a manual override that will allow the sensor to function as a wall switch.\n\n(2) Additional Locations\n\nAdditional lighting outlets shall be installed in accordance with the following:\n\nAt least one lighting outlet controlled by a listed wall-mounted control device shall be installed in hallways, stairways, attached garages, detached garages, and accessory buildings with electric power.\nFor dwelling units, attached garages, and detached garages with electric power, at least one exterior lighting outlet controlled by a listed wall-mounted control device shall be installed to provide illumination on the exterior side of outdoor entrances or exits with grade-level access. A vehicle door in a garage shall not be considered as an outdoor entrance or exit.\nException to (2): For an outdoor, grade-level bulkhead door with stairway access to a sub-grade-level basement, the required lighting outlet that provides illumination on the stairway steps shall be permitted to be located in the basement interior within 1.5 m (5 ft) horizontally of the bottommost stairway riser. This interior lighting outlet shall be permitted to be controlled by a listed wall-mounted control device or by a unit switch of the interior luminaire or interior lampholder.\n\nWhere lighting outlets are installed for an interior stairway with six or more risers between floor levels, there shall be a listed wall-mounted control device at each floor level and at each landing level that includes a stairway entry to control the lighting outlets.\nException to (1), (2), and (3): Remote, central, or automatic control of lighting shall be permitted in hallways, in stairways, and at outdoor entrances.\n\nDimmer control of lighting outlets installed in accordance with 210.70(A)(2)(3) shall not be permitted unless the listed control devices can provide dimming control to maximum brightness at each control location for the interior stairway illumination.\n\n(B) Guest Rooms or Guest Suites\n\nIn hotels, motels, or similar occupancies, guest rooms or guest suites shall have at least one lighting outlet controlled by a listed wall-mounted control device installed in every habitable room and bathroom.\n\nException No. 1: In other than bathrooms and kitchens where provided, one or more receptacles controlled by a listed wall-mounted control device shall be permitted in lieu of lighting outlets.\n\nException No. 2: Lighting outlets shall be permitted to be controlled by occupancy sensors that are (1) in addition to listed wall-mounted control devices or (2) located at a customary wall switch location and equipped with a manual override that allows the sensor to function as a wall switch.\n\n(C) All Occupancies\n\nFor attics and underfloor spaces, utility rooms, and basements, at least one lighting outlet containing a switch or controlled by a wall switch or listed wall-mounted control device shall be installed where these spaces are used for storage or contain equipment requiring servicing. A point of control shall be at each entry that permits access to the attic and underfloor space, utility room, or basement. Where a lighting outlet is installed for equipment requiring service, the lighting outlet shall be installed at or near the equipment.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  }
}
