{
  "1": {
    "content": "ELECTRICIANS\nOccupations Code\nChapter 1305\nAdministered by the Texas Department of Licensing and Regulation\n(Effective April, 2025).\n\nSUBCHAPTER A. GENERAL PROVISIONS\n\nSec. 1305.001. SHORT TITLE.\nThis chapter may be cited as the Texas Electrical Safety and Licensing Act.\n\nSec. 1305.002. DEFINITIONS.\n\nIn this chapter:\n\n(1) \"Advisory board\" means the Electrical Safety and Licensing Advisory Board.\n\n(1-a) \"Agricultural use\" means a use or activity involving agriculture, as defined by Section 11.002, Water Code, other than the processing of an agricultural commodity.\n\n(1-b) \"Apprenticeship training program\" means an electrical training program that is:\n(A) recognized by the Texas Workforce Commission or the Texas Higher Education Coordinating Board;\n(B) registered with the United States Department of Labor; or\n(C) a competency-based standardized craft training program that meets the training program standards of the United States Department of Labor Office of Apprenticeship.\n\n(2) \"Commission\" means the Texas Commission of Licensing and Regulation.\n\n(3) \"Department\" means the Texas Department of Licensing and Regulation.\n\n(4) \"Electrical code\" means the National Electrical Code published by the National Fire Protection Association as adopted by the commission.\n\n(5) \"Electrical contracting\" means the business of designing, installing, erecting, repairing, or altering electrical wires or conductors to be used for light, heat, power, or signaling purposes. The term includes the installation or repair of ducts, raceways, or conduits for the reception or protection of wires or conductors and the installation or repair of any electrical machinery, apparatus, or system used for electrical light, heat, power, or signaling.\n\n(6) \"Electrical contractor\" means a person engaged in electrical contracting.\n\n(7) \"Electrical engineer\" means a person licensed under Chapter 1001 who possesses the necessary qualifications, training, and technical knowledge to perform electrical engineering work in this state.\n\n(8) \"Electrical inspector\" means a person certified by the International Association of Electrical Inspectors or International Code Council.\n\n(9) \"Electrical sign contracting\" means the business of designing, manufacturing, installing, connecting, reconnecting, or servicing an electric sign, cold cathode, neon gas tubing, or outline gas tubing, or altering electric sign wiring or conductors either inside or outside of a building.",
    "audio": "https://drive.google.com/file/d/1gUDgv61HiADhCuzvGcCgeUsjJUNbLjwU/view?usp=drive_link"
  },
  "2": {
    "content": "(10) \"Electrical sign contractor\" means a person engaged in electrical sign contracting.\n\n(11) \"Electrical work\" means any labor or material used in installing, maintaining, or extending an electrical wiring system and the appurtenances, apparatus, or equipment used in connection with the use of electrical energy in, on, outside, or attached to a building, residence, structure, property, or premises. The term includes service entrance conductors as defined by the National Electrical Code.\n\n(11-a) \"Executive director\" means the executive director of the department.\n\n(11-b) \"Journeyman industrial electrician\" means an individual who engages in electrical work exclusively at a business that operates a chemical plant, petrochemical plant, refinery, natural gas plant, natural gas treating plant, pipeline, or oil and gas exploration and production operation.\n\n(12) \"Journeyman lineman\" means an individual who engages in electrical work involving the maintenance and operation of equipment associated with the transmission and distribution of electricity from the electricity's original source to a substation for further distribution.\n\n(12-a) \"Residential appliance\" means:\n\n(A) equipment that:\n\n(i) is installed as a unit in a single-family or multifamily dwelling that does not exceed four stories;\n(ii) is directly connected to an electrical circuit; and\n(iii) performs a specific function; or\n\n(B) a pool-related electrical device.\n\n(12-b) \"Residential appliance installation\" means electrical work that is limited to the connection or disconnection of a residential appliance, including a pool-related electrical device, to an existing electrical circuit other than by inserting or removing a plug from an electrical outlet.\n\n(12-c) \"Residential appliance installation contracting\" means the business of residential appliance installation, including pool-related electrical maintenance.",
    "audio": "https://drive.google.com/file/d/1SAGshmDcJaEF59B9RAD8_Oq9DnmldR-j/view?usp=drive_link"
  },
  "3": {
    "content": "(12-d) \"Residential appliance installation contractor\" means a business entity, other than an electrical contractor or electrical sign contractor, that is engaged in residential appliance installation contracting, including pool-related electrical maintenance.\n\n(12-e) \"Residential appliance installer\" means a person, other than a licensed electrician, who is licensed to perform residential appliance installation, including pool-related electrical maintenance.\n\n(13) \"Residential wireman\" means a person licensed under this chapter who may only perform electrical installations in single-family and multifamily dwellings not exceeding four stories.\n\n(14) \"Pool\" means an outdoor or indoor structure that is located at a residential property, a business property, or a property owned by a municipality and that is intended for swimming or recreational bathing, including an inground structure, aboveground structure, hot tub, spa, portable spa, or non-portable wading pool.\n\n(15) \"Pool-related electrical device\" means equipment for a pool that:\n\n(A) is installed as a unit;\n(B) is directly connected to an electrical circuit;\n(C) performs a specific function; and\n(D) uses single-phase power of 240 volts or less.\n\n(16) \"Pool-related electrical maintenance\" means electrical work that is limited to the connection or disconnection of a pool-related electrical device to an existing electrical circuit other than by inserting or removing a plug from an electrical outlet.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nAmended by Acts 2005, 79th Leg., Ch. 1052 (H.B. 1317), Sec. 1, eff. June 18, 2005.\n\nAmended by Acts 2007, 80th Leg., R.S., Ch. 418 (S.B. 1222), Sec. 1, eff. September 1, 2007.\n\nAmended by Acts 2009, 81st Leg., R.S., Ch. 416 (H.B. 1973), Sec. 1, eff. March 1, 2010.\n\nAmended by Acts 2009, 81st Leg., R.S., Ch. 741 (S.B. 470), Sec. 1, eff. September 1, 2009.\n\nAmended by Acts 2009, 81st Leg., R.S., Ch. 1392 (S.B. 1982), Sec. 1, eff. March 1, 2010.\n\nAmended by Acts 2011, 82nd Leg., R.S., Ch. 452 (S.B. 1630), Sec. 1, eff. June 17, 2011.\n\nAmended by Acts 2013, 83rd Leg., R.S., Ch. 882 (H.B. 796), Sec. 1, eff. June 14, 2013.\n\nAmended by Acts 2017, 85th Leg., R.S., Ch. 826 (H.B. 1698), Sec. 1, eff. September 1, 2017.",
    "audio": "https://drive.google.com/file/d/1kQ_GBVjl2fSqj7aUsWpAmPcPSaJVnpId/view?usp=drive_link"
  },
  "4": {
    "content": "Sec. 1305.003. EXEMPTIONS; APPLICATION OF CHAPTER.\n\n(a) This chapter does not apply to:\n\n(1) the installation of electrical equipment in a ship, watercraft other than a floating building, railway rolling stock, aircraft, motor vehicle, or recreational vehicle;\n\n(2) the installation of electrical equipment underground in a mine and in self-propelled mobile surface mining machinery and its attendant electrical trailing cable;\n\n(3) the installation of electrical equipment for generation, transformation, transmission, or distribution of power used exclusively to operate railway rolling stock or exclusively for signaling and communications purposes;\n\n(4) the installation, maintenance, alteration, or repair of communications equipment provided by a telecommunications provider;\n\n(5) the installation, maintenance, alteration, or repair of electrical equipment under the exclusive control of an electric utility, power generation company as defined by Sections 31.002(1) and (10), Utilities Code, electric cooperative, or municipally owned utility and used for communications or metering, or for the generation, control, transformation, transmission, and distribution of electrical energy, and located:\n\n(A) in a building used exclusively by a utility or power generation company for those purposes;\n\n(B) outdoors on property owned or leased by the utility or power generation company;\n\n(C) on public highways, streets, roads, or other public rights-of-way; or\n\n(D) outdoors by established rights in vaults or on private property;\n\n(6) work not specifically regulated by a municipal ordinance that is performed in or on a dwelling by a person who owns and resides in the dwelling;\n\n(7) work involved in the manufacture of electrical equipment that includes the on-site and off-site manufacturing, commissioning, testing, calibrating, coordinating, troubleshooting, or evaluating of electrical equipment, the repairing or retrofitting of electrical equipment with components of the same ampacity, and the maintenance and servicing of electrical equipment within the equipment's enclosure that is performed by an authorized employee or authorized representative of an electrical equipment manufacturer and limited to the type of products manufactured by the manufacturer;",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "5": {
    "content": "(8) electrical work if:\n\n(A) the work is performed by a person who does not engage in electrical work for the public;\n\n(B) the work is performed by a person regularly employed as a maintenance person or maintenance electrician for a business; and\n\n(C) the electrical work does not involve the installation of electrical equipment during new construction as defined by rules adopted under Chapter 151, Tax Code;\n\n(9) the installation, maintenance, alteration, or repair of electrical equipment or associated wiring under the exclusive control of a gas utility and used for communications or metering or for the control, transmission, or distribution of natural gas;\n\n(10) thoroughfare lighting, traffic signals, intelligent transportation systems, and telecommunications controlled by a governmental entity;\n\n(11) electrical connections supplying heating, ventilation, and cooling and refrigeration equipment, including any required disconnect exclusively for the equipment, if the service is performed by a licensed air conditioning and refrigeration contractor under Chapter 1302;\n\n(12) the design, installation, erection, repair, or alteration of Class 1, Class 2, or Class 3 remote control, signaling, or power-limited circuits, fire alarm circuits, optical fiber cables, or communications circuits, including raceways, as defined by the National Electrical Code;\n\n(13) landscape irrigation installers, as necessary to perform the installation and maintenance of irrigation control systems, and landscapers, as necessary to perform the installation and maintenance of low-voltage exterior lighting and holiday lighting excluding any required power source;\n\n(14) electrical work performed at a business that operates:\n\n(A) a chemical plant, petrochemical plant, refinery, natural gas plant, natural gas treating plant, pipeline, or oil and gas exploration and production operation by a person who works solely for and is employed by that business; or\n\n(B) a chemical plant, petrochemical plant, refinery, natural gas plant, or natural gas treatment plant by a person who under a contract of at least 12 months’ duration performs electrical work for that plant and:\n\n(i) the electrical work is not performed during new construction as defined by rules adopted under Chapter 151, Tax Code; or\n\n(ii) the person is not working for a contractor that has a principal place of business in another state or territory of the United States or a foreign country;",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "6": {
    "content": "(15) the installation, maintenance, alteration, or repair of elevators, escalators, or related equipment, excluding any required power source, regulated under Chapter 754, Health and Safety Code;\n\n(16) the installation, maintenance, alteration, or repair of equipment or network facilities provided or utilized by a cable operator, as that term is defined by 47 U.S.C. Section 522, as amended;\n\n(17) the location, design, construction, extension, maintenance, and installation of on-site sewage disposal systems in accordance with Chapter 366, Health and Safety Code, or an on-site sewage facility installer licensed under Chapter 37, Water Code;\n\n(18) electrical work performed on a building, structure, or equipment in agricultural use as defined by Section 11.002, Water Code, other than the processing of an agricultural commodity;\n\n(19) the installation, maintenance, alteration, or repair of well pumps and equipment in accordance with Chapter 1902;\n\n(20) electrical work required for the construction and assembly of HUD-code manufactured housing or modular housing and building units, other than the installation of service entrance conductors, that is performed by a licensed manufacturer or installer under Chapter 1201 or 1202, as applicable, if work performed is within the scope of the license as defined by applicable statutes and administrative rules;\n\n(21) work performed by a plumber who holds a license or endorsement or is registered under Chapter 1301 that is necessary to install, service, maintain, repair, or replace any type of plumbing fixture or appliance, as described by Section 1301.002(7), including a water heater, food disposer, garbage disposal, water softener, dishwashing machine, and clothes washing machine on existing electrical circuits only;\n\n(22) the maintenance or repair of a residential appliance by a residential appliance dealer or manufacturer or a person authorized by a residential appliance dealer or manufacturer using only components of the same type and ampacity as the original components; and\n\n(23) the maintenance, alteration, or repair of a pool-related electrical device by, or pool-related electrical maintenance performed by, an employee of a municipality on a pool owned or operated by the municipality.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "7": {
    "content": "(b) This chapter applies to all premises wiring that originates where an electric utility's facilities end and a nonutility customer's electric facilities begin, except as permitted by Section 161.123(2)(A), Utilities Code.\n\n(c) This chapter applies to an installation in a building used by a utility for purposes other than a purpose listed in this section, including an office building, warehouse, garage, machine shop, or recreational building that is not an integral part of a generating plant, substation, or control center.\n\n(d) This chapter does not require a political subdivision of this state, including a school district or a municipality, to hold an electrical contractor license or an electrical sign contractor license under this chapter to be authorized to employ a person to perform electrical work for the political subdivision.\n\n(e) Subsection (d) does not exempt an employee of a political subdivision from the requirement of holding the appropriate license under this chapter to perform electrical work.\n\n(f) For purposes of Subsection (a)(21), any installation or replacement of a plumbing fixture or appliance must meet the requirements of existing electrical circuits.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nAmended by Acts 2005, 79th Leg., Ch. 794 (S.B. 343), Sec. 2, eff. September 1, 2005.\n\nAmended by Acts 2005, 79th Leg., Ch. 1052 (H.B. 1317), Sec. 2, eff. June 18, 2005.\n\nAmended by Acts 2007, 80th Leg., R.S., Ch. 418 (S.B. 1222), Sec. 2, eff. September 1, 2007.\n\nAmended by Acts 2007, 80th Leg., R.S., Ch. 649 (H.B. 1029), Sec. 1, eff. June 15, 2007.\n\nAmended by Acts 2009, 81st Leg., R.S., Ch. 87 (S.B. 1969), Sec. 17.002, eff. September 1, 2009.\n\nAmended by Acts 2009, 81st Leg., R.S., Ch. 416 (H.B. 1973), Sec. 2, eff. September 1, 2009.\n\nAmended by Acts 2009, 81st Leg., R.S., Ch. 1392 (S.B. 1982), Sec. 2, eff. September 1, 2009.\n\nSec. 1305.004. NONAPPLICABILITY OF LAW GOVERNING CANCELLATION OF CERTAIN TRANSACTIONS.\n\nExcept as otherwise provided by this section, Chapter 601, Business & Commerce Code, does not apply to a good or service provided by a license holder under this chapter if the transaction involving the good or service is initiated by the consumer. Chapter 601, Business & Commerce Code, does apply to a transaction that involves a breach of express warranty or a negligent installation in violation of a building code applicable to the good or service sold to the consumer.\n\nAdded by Acts 2009, 81st Leg., R.S., Ch. 937 (H.B. 3129), Sec. 3, eff. June 19, 2009.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "8": {
    "content": "SUBCHAPTER B. ADVISORY BOARD\n\nSec. 1305.051. ELECTRICAL SAFETY AND LICENSING ADVISORY BOARD.\n\n(a) The advisory board consists of nine members appointed by the presiding officer of the commission with the approval of the commission as follows:\n\n(1) three master electrician members;\n\n(2) three journeyman electrician members;\n\n(3) one master sign electrician member; and\n\n(4) two public members.\n\n(b) The advisory board members must include:\n\n(1) two members who are affiliated with a statewide association of electrical contractors not affiliated with a labor organization;\n\n(2) three members who are affiliated with a labor organization;\n\n(3) one member who is not affiliated with a statewide association of electrical contractors or with a labor organization;\n\n(4) one member who is affiliated with a historically underutilized business, as that term is defined by Section 2161.001, Government Code; and\n\n(5) one public member who is a building contractor principally engaged in home construction and is a member of a statewide building trade association.\n\n(c) A licensed electrical engineer or an electrical inspector may be appointed as a public member of the advisory board.\n\n(d) An appointment to the advisory board shall be made without regard to the race, color, disability, sex, religion, age, or national origin of the appointee.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nAmended by Acts 2013, 83rd Leg., R.S., Ch. 926 (H.B. 1503), Sec. 3, eff. June 14, 2013.\n\nAmended by Acts 2015, 84th Leg., R.S., Ch. 156 (H.B. 1077), Sec. 1, eff. September 1, 2015.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "9": {
    "content": "Sec. 1305.052. TERMS; VACANCIES.\n\n(a) Advisory board members serve terms of six years, with the terms of three members expiring on February 1 of each odd-numbered year.\n\n(b) A member may not consecutively serve more than two full terms.\n\n(c) If a vacancy occurs during a term, the presiding officer of the commission shall appoint a replacement who meets the qualifications of the vacated position to serve for the remainder of the term.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.053. PRESIDING OFFICER.\n\nThe presiding officer of the commission shall appoint one of the advisory board members to serve as presiding officer of the advisory board for a term of one year. The presiding officer of the advisory board may vote on any matter before the advisory board.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.054. COMPENSATION; REIMBURSEMENT OF EXPENSES.\n\nAdvisory board members may not receive compensation but are entitled to reimbursement for actual and necessary expenses incurred in performing the functions of the advisory board, subject to the General Appropriations Act.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.055. MEETINGS.\n\nThe advisory board shall meet twice annually and may meet at other times at the call of the presiding officer of the commission.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "10": {
    "content": "SUBCHAPTER C. POWERS AND DUTIES\n\nSec. 1305.101. GENERAL POWERS AND DUTIES.\n\n(a) The executive director or commission, as appropriate, shall:\n\n(1) by rule establish the financial responsibility requirements for electrical contractors; and\n\n(2) after publication of the National Electrical Code by the National Fire Protection Association every three years, adopt the revised National Electrical Code as the electrical code for the state.\n\n(b) The executive director or commissioner, as appropriate, may:\n\n(1) establish reciprocity agreements with other states that have licensing requirements substantially equivalent to the requirements of this chapter; and\n\n(2) take other action as necessary to administer and enforce this chapter.\n\nSec. 1305.102. RULES.\n\n(a) The commission shall adopt rules for the licensing of electricians, sign electricians, electrical sign contractors, electrical contractors, journeyman industrial electricians, journeyman linemen, residential appliance installers, and residential appliance installation contractors as prescribed by this chapter.\n\n(b) The executive director by rule shall prescribe descriptions of the types of activities that may be performed by each class of license holder under this chapter.\n\n(c) The executive director by rule shall adopt standards of conduct requirements for license holders under this chapter.\n\n(d) The commission may adopt rules regarding the registration of apprenticeship training programs and to require registered programs to report the names of persons enrolled in the programs.\n\nSec. 1305.103. FEES.\n\nThe commission shall establish and collect reasonable and necessary fees in amounts sufficient to cover the costs of administering this chapter.\n\nSec. 1305.104. POWERS AND DUTIES OF ADVISORY BOARD.\n\nThe advisory board shall provide advice and recommendations to the department on technical matters relevant to the administration and enforcement of this chapter, including examination content, licensing standards, electrical code requirements, and continuing education requirements.\n\nSec. 1305.105. PERSONNEL.\n\nThe department may employ personnel necessary to administer and enforce this chapter. The department shall employ an electrical occupations and code specialist to oversee the electrical licensing and safety program.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "11": {
    "content": "SUBCHAPTER D. LICENSE REQUIREMENTS\n\nSec. 1305.151. LICENSE REQUIRED.\n\nExcept as provided by Section 1305.003, a person or business may not perform or offer to perform electrical work or residential appliance installation unless the person or business holds an appropriate license issued or recognized under this chapter.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2004.\n\nAmended by Acts 2005, 79th Leg., Ch. 1052 (H.B. 1317), Sec. 3, eff. June 18, 2005.\n\nAmended by Acts 2007, 80th Leg., R.S., Ch. 418 (S.B. 1222), Sec. 4, eff. March 1, 2008.\n\nSec. 1305.152. APPLICATION REQUIREMENTS.\n\n(a) An applicant for a license under this chapter must:\n\n(1) submit to the department a completed application on a form prescribed by the executive director;\n\n(2) submit to the department any other information required by executive director rule;\n\n(3) demonstrate to the satisfaction of the executive director the appropriate amount of electrical work experience as required by this subchapter; and\n\n(4) pay the application and examination fees.\n\n(b) The executive director shall adopt rules to establish a process by which the department shall evaluate the experience required of applicants for a license under this chapter.\n\n(c) The department may conduct an examination of any criminal conviction of an applicant, including obtaining any criminal history record information permitted by law.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nAmended by Acts 2019, 86th Leg., R.S., Ch. 400 (S.B. 1531), Sec. 4, eff. September 1, 2019.\n\nSec. 1305.153. MASTER ELECTRICIAN.\n\n(a) An applicant for a license as a master electrician must:\n\n(1) have at least 12,000 hours of on-the-job training under the supervision of a master electrician;\n\n(2) have held a journeyman electrician license for at least two years; and\n\n(3) pass a master electrician examination administered under this chapter.\n\n(b) A master electrician may:\n\n(1) perform all electrical work, including electrical work performed by a master sign electrician;\n\n(2) supervise an electrician;\n\n(3) verify compliance with on-the-job training requirements for issuance of a master electrician license, master sign electrician license, journeyman electrician license, or journeyman sign electrician license; and\n\n(4) serve as master of record for an electrical sign contractor.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nAmended by Acts 2005, 79th Leg., Ch. 1052 (H.B. 1317), Sec. 4, eff. June 18, 2005.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "12": {
    "content": "Sec. 1305.154. MASTER SIGN ELECTRICIAN.\n\nAn applicant for a license as a master sign electrician must:\n\n(1) have at least 12,000 hours of on-the-job training under the supervision of a master sign electrician; and\n\n(2) pass a master sign electrician examination administered under this chapter.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.155. JOURNEYMAN ELECTRICIAN.\n\nAn applicant for a license as a journeyman electrician must:\n\n(1) have at least 8,000 hours of on-the-job training under the supervision of a master electrician; and\n\n(2) pass a journeyman electrician examination administered under this chapter.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.156. JOURNEYMAN SIGN ELECTRICIAN.\n\nAn applicant for a license as a journeyman sign electrician must:\n\n(1) have at least 8,000 hours of on-the-job training under the supervision of a master sign electrician; and\n\n(2) pass a journeyman sign electrician examination administered under this chapter.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.157. RESIDENTIAL WIREMAN.\n\nAn applicant for a license as a residential wireman must:\n\n(1) have at least 4,000 hours of on-the-job training under the supervision of a master electrician or residential wireman; and\n\n(2) pass a residential wireman examination administered under this chapter.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.158. MAINTENANCE ELECTRICIAN.\n\nAn applicant for a license as a maintenance electrician must:\n\n(1) have at least 8,000 hours of on-the-job training under the supervision of a master electrician or maintenance electrician; and\n\n(2) pass a maintenance electrician examination administered under this chapter.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "13": {
    "content": "Sec. 1305.159. ELECTRICAL CONTRACTOR.\n\n(a) An applicant for a license as an electrical contractor must:\n\n(1) be licensed under this chapter as a master electrician or employ a person licensed under this chapter as a master electrician;\n\n(2) establish proof of financial responsibility in the manner prescribed by the executive director; and\n\n(3) maintain workers' compensation coverage for the contractor's employees through an insurance company authorized to engage in the business of insurance in this state or through self-insurance, or elect not to obtain workers' compensation coverage, as provided by Subchapter A, Chapter 406, Labor Code.\n\n(b) A person who holds a master electrician license issued or recognized under this chapter may only be assigned to a single electrical contractor, unless the master electrician owns more than 50 percent of the electrical contracting business.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.160. ELECTRICAL SIGN CONTRACTOR.\n\n(a) An applicant for a license as an electrical sign contractor must:\n\n(1) be licensed under this chapter as a master sign electrician or employ a person licensed under this chapter as a master sign electrician;\n\n(2) establish proof of financial responsibility in the manner prescribed by the executive director; and\n\n(3) maintain workers' compensation coverage for the contractor's employees through an insurance company authorized to engage in the business of insurance in this state or through self-insurance, or elect not to obtain workers' compensation coverage, as provided by Subchapter A, Chapter 406, Labor Code.\n\n(b) A person who holds a master sign electrician license issued or recognized under this chapter may only be assigned to a single electrical sign contractor, unless the master sign electrician owns more than 50 percent of the electrical sign contracting business.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nAmended by Acts 2005, 79th Leg., Ch. 1052 (H.B. 1317), Sec. 5, eff. June 18, 2005.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "14": {
    "content": "Sec. 1305.1601. JOURNEYMAN INDUSTRIAL ELECTRICIAN.\n\nAn applicant for a license as a journeyman industrial electrician must:\n\n(1) have at least 8,000 hours of on-the-job training as a licensed electrical apprentice under the supervision of a master electrician; and\n\n(2) pass a journeyman industrial electrician examination administered under this chapter.\n\nAdded by Acts 2017, 85th Leg., R.S., Ch. 826 (H.B. 1698), Sec. 3, eff. September 1, 2017.\n\nSec. 1305.1605. JOURNEYMAN LINEMAN.\n\n(a) An applicant for a license as a journeyman lineman must:\n\n(1) have at least:\n\n(A) 7,000 hours of training in an apprenticeship program approved by the United States Department of Labor; or\n\n(B) 3-1/2 years of experience as a journeyman lineman for an electric utility, electric cooperative, municipally owned utility, or electrical contractor in this state; and\n\n(2) pass a journeyman lineman examination administered under this chapter.\n\n(b) A journeyman lineman license is not required for:\n\n(1) a person performing work exempt under Section 1305.003(a)(5); or\n\n(2) a person who:\n\n(A) is performing journeyman lineman work;\n\n(B) possesses a journeyman electrician license; and\n\n(C) is employed by an institution of higher education, as defined by Section 61.003, Education Code.\n\nAdded by Acts 2013, 83rd Leg., R.S., Ch. 882 (H.B. 796), Sec. 3, eff. June 14, 2013.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "15": {
    "content": "Sec. 1305.161. APPRENTICE; TEMPORARY APPRENTICE.\n\n(a) Except as provided by Subsection (b), an applicant for a license as an electrical apprentice must be at least 16 years of age and be engaged in the process of learning and assisting in the installation of electrical work under the supervision of a licensed master electrician.\n\n(b) An applicant for a license as an electrical sign apprentice must be at least 18 years of age and be engaged in the process of learning and assisting in the performance of electrical sign work under the supervision of a licensed master sign electrician.\n\n(c) On the request of an applicant for an apprentice license, the executive director shall issue a temporary apprentice license that expires on the 21st day after the date of issuance to an applicant who meets the qualifications established by the executive director.\n\n(d) The commission by rule shall set the fee, establish the qualifications, and provide for the issuance of a temporary apprentice license under this section.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nAmended by Acts 2005, 79th Leg., Ch. 1052 (H.B. 1317), Sec. 6, eff. June 18, 2005.\n\nSec. 1305.1615. EMERGENCY ELECTRICIAN LICENSE.\n\n(a) The commission by rule shall establish criteria and procedures for the issuance of an emergency electrician license following a disaster, as that term is defined by Section 418.004, Government Code, to a person licensed as an electrician in another state of the United States.\n\n(b) An emergency license issued under this section expires on the 90th day after the date of issuance.\n\n(c) The commission, with the advice of the advisory board, may adopt rules that provide for the extension of an emergency license issued under this section.\n\nAdded by Acts 2005, 79th Leg., Ch. 1052 (H.B. 1317), Sec. 7, eff. June 18, 2005.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "16": {
    "content": "Sec. 1305.1617. RESIDENTIAL APPLIANCE INSTALLER.\n\nAn applicant for a license as a residential appliance installer must pass a residential appliance installer examination administered under this chapter.\n\nAdded by Acts 2007, 80th Leg., R.S., Ch. 418 (S.B. 1222), Sec. 5, eff. September 1, 2007.\n\nSec. 1305.1618. RESIDENTIAL APPLIANCE INSTALLATION CONTRACTOR.\n\n(a) An applicant for a license as a residential appliance installation contractor must:\n\n(1) be licensed under this chapter as a residential appliance installer or employ a person licensed under this chapter as a residential appliance installer;\n\n(2) establish proof of financial responsibility in the manner prescribed by the executive director; and\n\n(3) maintain workers' compensation coverage for the contractor's employees through an insurance company authorized to engage in the business of insurance in this state or through self-insurance, or elect not to obtain workers' compensation coverage, as provided by Subchapter A, Chapter 406, Labor Code.\n\n(b) A person who holds a residential appliance installer's license issued or recognized under this chapter may only be assigned to a single residential appliance installation contractor, unless the residential appliance installer owns more than 50 percent of the residential appliance installation contracting business.\n\nAdded by Acts 2007, 80th Leg., R.S., Ch. 418 (S.B. 1222), Sec. 5, eff. September 1, 2007.\n\nSec. 1305.162. EXAMINATIONS.\n\n(a) Examinations required by this subchapter shall be conducted throughout the state.\n\n(b) The department shall accept, develop, or contract for the examinations required by this chapter, including the administration of the examinations. Each examination must test the knowledge of the applicant about materials and methods used in electrical installations related to the activities that may be performed within each class of license under this chapter and the standards prescribed by the National Electrical Code as adopted by the executive director.\n\n(c) The executive director shall determine uniform standards for acceptable performance on an examination.\n\n(d) In addition to the other requirements of this section, the department shall accept, develop, or contract for a residential appliance installer examination that tests an applicant's knowledge of the materials and methods used in the installation of residential appliances and pool-related devices under this chapter and the National Electrical Code standards as adopted by the executive director.\n\n(e) Notwithstanding Subsection (b), an examination required for a license as a journeyman industrial electrician under Section 1305.1601 may only test an applicant regarding activities performed by a journeyman industrial electrician at a location described by Section 1305.002(11-b).\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\nAmended by Acts 2009, 81st Leg., R.S., Ch. 416 (H.B. 1973), Sec. 3, eff. September 1, 2009.\nAmended by Acts 2009, 81st Leg., R.S., Ch. 1392 (S.B. 1982), Sec. 3, eff. September 1, 2009.\nAmended by Acts 2017, 85th Leg., R.S., Ch. 826 (H.B. 1698), Sec. 4, eff. September 1, 2017.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "17": {
    "content": "Sec. 1305.163. EXAMINATION RESULTS.\n\n(a) Not later than the 30th day after the date on which an examination is administered under this chapter, the department shall notify each examinee of the results of the examination. If an examination is graded or reviewed by a national testing service, the department shall notify examinees of the result of the examination not later than the 14th day after the date on which the department receives the results from the testing service.\n\n(b) If the notice of the examination results will be delayed for more than 60 days after the examination date, the department shall notify each examinee of the reason for the delay before the 60th day.\n\n(c) If requested in writing by a person who fails an examination administered under this chapter, the department shall provide to the person an analysis of the person's performance on the examination.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.164. NONRESIDENT LICENSE APPLICANT.\n\nThe executive director may issue a license under this chapter to an applicant who holds a license in another state and who submits a proper application and pays the required fees if the executive director determines that the applicant is licensed in a state with which there is an agreement to recognize licenses issued under this chapter.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.1645. LICENSE ELIGIBILITY REQUIREMENTS FOR APPLICANTS WITH MILITARY EXPERIENCE.\n\n(a) Notwithstanding any other law, the department shall credit verified military service, training, or education toward the licensing requirements, other than examination requirements, for a license issued under this chapter by the department.\n\n(b) The department shall expedite the issuance of a temporary license or a license by endorsement or reciprocity under this chapter to an applicant who:\n\n(1) has verified military experience; and\n\n(2) holds a current license issued by another jurisdiction that has license requirements that are substantially equivalent to the license requirements of this state.\n\n(c) The commission shall adopt rules necessary to implement this section.\n\nAdded by Acts 2013, 83rd Leg., R.S., Ch. 977 (H.B. 2029), Sec. 1, eff. June 14, 2013.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "18": {
    "content": "Sec. 1305.165. LICENSE ISSUANCE; NONTRANSFERABILITY.\n\n(a) Not later than the 30th day after the date on which the department determines that an applicant has passed the examination required under this chapter, the executive director shall issue a license to the applicant if the applicant has complied with the application requirements and paid the fees required by this chapter.\n\n(b) A license issued by the executive director is valid throughout this state and is not transferable.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.166. DISPLAY OF LICENSE.\n\n(a) An electrical contractor, electrical sign contractor, and residential appliance installation contractor shall display the contractor's business name and the number of the license issued by the executive director on each vehicle owned by the contractor.\n\n(b) The information required to be displayed must be:\n\n(1) printed in letters and numbers that are at least two inches high and in a color that contrasts with the color of the background surface; and\n\n(2) permanently affixed in conspicuous places on both sides of the vehicle.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2004.\n\nAmended by Acts 2007, 80th Leg., R.S., Ch. 418 (S.B. 1222), Sec. 6, eff. September 1, 2007.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "19": {
    "content": "Sec. 1305.167. LICENSE RENEWAL.\n\n(a) Except as provided by Subsection (b), a license expires annually on December 31 and may be renewed annually on payment of the required renewal fee.\n\n(b) The executive director by rule may adopt a system under which licenses expire on various dates during the year. For the year in which the license expiration date is changed, renewal fees payable on or before December 31 shall be prorated on a monthly basis so that each license holder pays only that portion of the renewal fee that is applicable to the number of months during which the license is valid. On renewal of the license on the new expiration date, the total renewal fee is due.\n\n(c) Not later than the 30th day preceding the expiration date of a person's license, the department shall notify the person in writing, at the person's last known mailing address, of the impending license expiration. A person may renew an unexpired license by paying to the department, before the license expiration date, the required renewal fee.\n\n(d) Repealed by Acts 2005, 79th Leg., Ch. 1052, Sec. 11, eff. June 18, 2005.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "20": {
    "content": "SUBCHAPTER E. REGULATION OF ELECTRICIANS BY LOCAL GOVERNMENTS\n\nSec. 1305.201. MUNICIPAL OR REGIONAL REGULATION.\n\n(a) This chapter does not prohibit a municipality or region from regulating electricians or residential appliance installers by:\n\n(1) enacting an ordinance requiring inspections;\n\n(2) offering examinations;\n\n(3) issuing municipal or regional licenses; or\n\n(4) collecting permit fees for municipal or regional licenses and examinations from appliance installers for work performed in the municipality or region.\n\n(b) A municipality or region may not require a person to take a municipal or regional examination if that person holds the appropriate license issued under this chapter and is working within the scope of that license.\n\n(c) A municipality may adopt procedures for the:\n\n(1) adoption of local amendments to the National Electrical Code; and\n\n(2) administration and enforcement of that code.\n\n(d) Electrical work performed within the corporate limits of a municipality must be installed in accordance with all applicable local ordinances.\n\n(e) Electrical work performed in an unincorporated area of the state must be installed in accordance with standards at least as stringent as the requirements of the state electrical code as adopted under Section 1305.101.\n\n(f) A municipality or region may not collect a permit fee, registration fee, administrative fee, or any other fee from an electrician who holds a license issued under this chapter for work performed in the municipality or region. This subsection does not prohibit a municipality or region from collecting a building permit fee.\n\nSec. 1305.202. SCOPE OF MUNICIPAL OR REGIONAL LICENSE.\n\n(a) A license to perform electrical work issued by a municipality or region is valid only in the municipality or region or in another municipality or region under a reciprocal agreement.\n\n(b) A person who holds a license to perform electrical work or electrical sign work issued by a municipality or region that elects to discontinue issuing or renewing licenses may apply for an equivalent license under this chapter without complying with the applicable examination requirement if the person:\n\n(1) held the municipal or regional license for the preceding year; and\n\n(2) submits an application for a license under this chapter within 90 days of the date the municipality or region stops issuing or renewing licenses.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "21": {
    "content": "SUBCHAPTER F. LICENSE DENIAL AND DISCIPLINARY ACTIONS\n\nSec. 1305.251. GROUNDS FOR DENIAL OR DISCIPLINARY ACTION.\n\nA person is subject to denial of a license application or disciplinary action under Section 51.353 if the person violates:\n\n(1) this chapter or a rule adopted under this chapter; or\n\n(2) a rule or order of the executive director or commission.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.252. REQUESTED SUSPENSION BY LOCAL GOVERNMENT.\n\nA municipality or region may request suspension for just cause of the license under this chapter of a license holder working in its jurisdiction.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.253. HEARINGS; ADMINISTRATIVE PROCEDURE.\n\n(a) If the department proposes to deny a license or take disciplinary action against a license holder, the license holder is entitled to a hearing.\n\n(b) The proceedings relating to a license denial and disciplinary action by the department under this chapter are governed by Chapter 2001, Government Code. A hearing under this chapter may be conducted by a hearings officer designated by the commission.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.254. NEW APPLICATION BY HOLDER OF REVOKED LICENSE.\n\nA license holder whose license has been revoked may apply for a new license after the first anniversary of the date of the revocation.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "22": {
    "content": "SUBCHAPTER G. ENFORCEMENT\n\nSec. 1305.301. ADMINISTRATIVE PENALTY.\n\n(a) The executive director may impose an administrative penalty on a person under Subchapter F, Chapter 51, regardless of whether the person holds a license under this chapter, if the person violates:\n\n(1) this chapter or a rule adopted under this chapter; or\n\n(2) a rule or order of the executive director or commission.\n\n(b) An administrative penalty may not be imposed unless the person charged with a violation is provided the opportunity for a hearing.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nSec. 1305.302. CEASE AND DESIST ORDER; INJUNCTION; CIVIL PENALTY.\n\n(a) The executive director may issue a cease and desist order as necessary to enforce this chapter if the executive director determines that the action is necessary to prevent a violation of this chapter and to protect public health and safety.\n\n(b) The attorney general or executive director may institute an action for an injunction or a civil penalty under this chapter as provided by Section 51.352.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "23": {
    "content": "Sec. 1305.303. CRIMINAL PENALTY.\n\n(a) A person subject to this chapter commits an offense if the person:\n\n(1) violates the licensing requirements of this chapter;\n\n(2) performs electrical work without a license to perform electrical work in this state;\n\n(3) employs an individual who does not hold the appropriate license required by this chapter; or\n\n(4) falsifies a certification of on-the-job training.\n\n(b) An offense under this section is a Class C misdemeanor.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2004.\n\nFor more information about TDLR Electrician Laws visit Website at\n\nhttps://www.tdlr.texas.gov/electricians/eleclaw.htm#1305303\n\nNOTE: AS AMENDED BY ACTS 2015, 84th LEG., HB 1077, SECTION 2 READS:\n\nThe change in law made by this Act to Section 1301.051(a), Occupations Code, regarding the qualifications for a member of the Electrical Safety and Licensing Advisory Board do not affect the entitlement of a member serving on the board immediately before the effective date of this Act to continue to serve and function as a member of the board for the remainder of the member’s term. When board vacancies occur on or after the effective date of this Act, the presiding officer of the Texas Commission of Licensing and Regulation shall appoint new members to the board in a manner that reflects the changes in law made by this Act.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "24": {
    "content": "ELECTRICIANS\nAdministrative Rules of the Texas Department of Licensing and Regulation\n16 Texas Administrative Code, Chapter 73\n(As in effect on April, 2025)\n\n73.1. Authority\n(Effective March 1, 2004, 29. TexReg 1653)\nThese rules are promulgated under the authority of Title 8, Occupations Code, Chapter 1305, and Title 2, Occupations Code, Chapter 51.\n\n73.10. Definitions.\n(1) Assumed name--A name used by a business as defined in the Business and Commerce Code.\n(2) Business affiliation--The business organization to which a master licensee may assign his or her license.\n(3) Career and technology education program--An educational program, defined in §1302.5037(a)(1) of the Act, focused on electrical training and either:\n(A) offered by a public high school under Subchapter F, Chapter 29, Education Code; or\n(B) offered by a private high school or institution of higher education and determined by the department to be similar to a program described by subparagraph (A) of this paragraph.\n(4) Employee--An individual who performs tasks assigned to him by his employer. The employee is subject to the deduction of social security and federal income taxes from his pay. An employee may be full time, part time, or seasonal.\n(5) Employer--One who employs the services of employees, pays their wages, deducts the required social security and federal income taxes from the employee's pay, and directs and controls the employee's performance.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "25": {
    "content": "(6) Filed--A document is deemed to have been filed with the department on the date that the document has been received by the department or, if the document has been mailed to the department, the date a postmark is applied to the document by the U.S. Postal Service.\n\n(7) General Supervision--Exercise of oversight by a master electrician on behalf of an electrical contractor, or electrical sign contractor, or by a master sign electrician on behalf of an electrical sign contractor of performance by all classes of electrical licensees of electrical work bearing responsibility for the work's compliance with applicable codes under Texas Occupations Code, Chapter 1305.\n\n(8) On-Site Supervision--Exercise of supervision of electrical work or electrical sign work by a licensed individual other than an electrical apprentice. Continuous supervision of an electrical apprentice is not required, though the on-site supervising licensee is responsible for review and inspection of the electrical apprentice's work to ensure compliance with any applicable codes or standards.\n\n(9) Electrical Contractor--A person, or entity, licensed as an electrical contractor, that is in the business of performing \"Electrical Contracting\" as defined by Texas Occupations Code, §1305.002(5).\n\n(10) Master Electrician--An individual, licensed as a master electrician, who on behalf of an electrical contractor, electrical sign contractor, or employing governmental entity, performs \"Electrical Work\" as defined by Texas Occupations Code, §1305.002(11).\n\n(11) Journeyman Electrician--An individual, licensed as a journeyman electrician, who works under the general supervision of a master electrician, on behalf of an electrical contractor, or employing governmental entity, while performing \"Electrical Work\" as defined by Texas Occupations Code, §1305.002(11).\n\n(12) Electrical Apprentice--An individual, licensed as an apprentice who works under the on-site supervision of a master electrician, journeyman electrician, or residential wireman, on behalf of an electrical contractor or employing governmental entity performing \"Electrical Work\" as defined by Texas Occupations Code, §1305.002(11).\n\n(13) Electrical Sign Contractor--A person, or entity, licensed as an electrical sign contractor, that is in the business of performing \"Electrical Sign Contracting\" as defined by Texas Occupations Code, §1305.002(9).\n\n(14) Institution of higher education--An \"institution of higher education\" or a \"private or independent institution of higher education,\" as those terms are defined by §61.003, Education Code.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "26": {
    "content": "(15) Master Sign Electrician--An individual, licensed as a master sign electrician, who, on behalf of an electrical sign contractor, performs \"Electrical Sign Work\" as defined in paragraph (20).\n\n(16) Journeyman Sign Electrician--An individual, licensed as a journeyman sign electrician, who works under the general supervision of a master electrician or a master sign electrician, on behalf of an electrical sign contractor, while performing \"Electrical Sign Work\" as defined in paragraph (20).\n\n(17) Residential Wireman--An individual, licensed as a residential wireman, who works under the general supervision of a master electrician, on behalf of an electrical contractor, or employing governmental entity, while performing electrical work that is limited to electrical installations in single family and multifamily dwellings not exceeding four stories, as defined by Texas Occupations Code, §1305.002(13).\n\n(18) Maintenance Electrician--An individual, licensed as a maintenance electrician, who works under the general supervision of a master electrician, on behalf of an electrical contractor, or employing governmental entity while performing \"Electrical Maintenance Work\" as defined in paragraph (19).\n\n(15) Residential Wireman--An individual, licensed as a residential wireman, who works under the general supervision of a master electrician, on behalf of an electrical contractor, or employing governmental entity, while performing electrical work that is limited to electrical installations in single family and multifamily dwellings not exceeding four stories, as defined by Texas Occupations Code, §1305.002(13).\n\n(16) Maintenance Electrician--An individual, licensed as a maintenance electrician, who works under the general supervision of a master electrician, on behalf of an electrical contractor, or employing governmental entity while performing “Electrical Maintenance Work” as defined in paragraph (17).\n\n(17) Electrical Maintenance Work--The replacement, or repair of existing electrical appurtenances, apparatus, equipment, machinery, or controls used in connection with the use of electrical energy in, on, outside, or attached to a building, residence, structure, property, or premises. All replacements or repairs must be of the same rating and type as the existing installation. No improvements may be made that are necessary to comply with applicable codes under Texas Occupations Code, Chapter 1305. Electrical maintenance work does not include the installation of any new electrical appurtenances, apparatus, equipment, machinery, or controls beyond the scope of any existing electrical installation.\n\n(18) Electrical Sign Work--Any labor or material used in manufacturing, installing, maintaining, extending, connecting or reconnecting an electrical wiring system and its appurtenances, apparatus or equipment used in connection with signs, outline lighting, awnings, signals, light emitting diodes, and the repair of existing outdoor electric discharge lighting, including parking lot pole lighting. This also includes the installation of an electrical service integral to an isolated sign and/or outline lighting installation.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "27": {
    "content": "(19) Electrical Maintenance Work--The replacement, or repair of existing electrical appurtenances, apparatus, equipment, machinery, or controls used in connection with the use of electrical energy in, on, outside, or attached to a building, residence, structure, property, or premises. All replacements or repairs must be of the same rating and type as the existing installation. No improvements may be made that are necessary to comply with applicable codes under Texas Occupations Code, Chapter 1305. Electrical maintenance work does not include the installation of any new electrical appurtenances, apparatus, equipment, machinery, or controls beyond the scope of any existing electrical installation.\n\n(20) Electrical Sign Work--Any labor or material used in manufacturing, installing, maintaining, extending, connecting or reconnecting an electrical wiring system and its appurtenances, apparatus or equipment used in connection with signs, outline lighting, awnings, signals, light emitting diodes, and the repair of existing outdoor electric discharge lighting, including parking lot pole lighting. This also includes the installation of an electrical service integral to an isolated sign and/or outline lighting installation.\n\n(21) Work Involved in the Manufacture of Electrical Equipment--Work involved in the manufacture of electrical equipment includes on and off-site manufacture, commissioning, testing, calibration, coordination, troubleshooting, evaluation, repair or retrofits with components of the same ampacity, maintenance and servicing of electrical equipment within their enclosures performed by authorized employees, or authorized representatives of electrical equipment manufacturers and limited to the type of products they manufacture.\n\n(22) Electrical Sign Apprentice--An individual, licensed as an electrical sign apprentice who works under the on-site supervision of a master electrician, a master sign electrician, or a journeyman sign electrician, on behalf of an electrical sign contractor performing \"Electrical Sign Work\" as defined by this chapter.\n\n(23) On-the-job Training--Training or experience gained under the supervision of an appropriate licensee, as prescribed by Texas Occupations Code Chapter 1305, while performing electrical work as defined by Texas Occupations Code, §1305.002(11).",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "28": {
    "content": "(24) Residential Appliance Installer--An individual, licensed as a residential appliance installer, who on behalf of a residential appliance installation contractor, performs electrical work that is limited to residential appliance installation including residential pool-related electrical installation and maintenance as defined by Texas Occupations Code, §1305.002(12-b).\n\n(25) Residential Appliance Installation Contractor--A person or entity licensed as a residential appliance installation contractor, that is in the business of residential appliance installation including pool-related electrical installation and maintenance as defined by Texas Occupations Code §1305.002(12-d).\n\n(26) Residential Appliance--Electrical equipment that performs a specific function, and is installed as a unit in a dwelling by direct connection to an existing electrical circuit, such as water heaters, kitchen appliances, or pool-related electrical device. The term does not include general use equipment such as service equipment, other electrical power production sources, or branch circuit overcurrent protection devices not installed in the listed appliance or listed pool-related electrical device.\n\n(27) Offer to perform--To make a written or oral proposal, to contract in writing or orally to perform electrical work or electrical sign work, to advertise in any form through any medium that a person or business entity is an electrical contractor, electrical sign contractor, or residential appliance installation contractor or that implies in any way that a person or business entity is available to contract for or perform electrical work, electrical sign work, or residential appliance installation work.\n\n(28) Electro Mechanical Integrity--The condition of an electrical product, electrical system, or electrical equipment installed in accordance with its intended purpose and according to standards at least as strict as the standards provided by the National Electrical Code, the manufacturer's specifications, any listing or labeling on the product, and all other applicable codes or ordinances.\n\n(29) Journeyman Lineman--An individual who engages in electrical work involving the maintenance and operation of equipment associated with the transmission and distribution of electricity from the electricity's original source to a substation for further distribution.\n\n(30) Journeyman Industrial Electrician--An individual who engages in electrical work exclusively at a business that operates a chemical plant, petrochemical plant, refinery, natural gas plant, natural gas treating plant, pipeline, or oil and gas exploration and production operation.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "29": {
    "content": "73.20. Licensing Requirements--Applicant and Experience Requirements.\n\n(Effective March 1, 2004, 29 TexReg 1653; amended effective October 20, 2005, 30 TexReg 6730; amended effective December 1, 2007, 32 TexReg 8477; amended effective January 1, 2010, 34 TexReg 9433; amended effective March 15, 2012, 37 TexReg 1703; amended effective January 1, 2014, 38 TexReg 951; amended effective May 1, 2018, 43 TexReg 2398; amended effective December 1, 2019, 44 TexReg 7183)\n\n(a) An applicant for a license must submit the required fees with a completed application and the appropriate attachments:\n\n(1) Applicants for Master Electrician, Master Sign Electrician, Journeyman Electrician, Journeyman Sign Electrician, Residential Wireman, Journeyman Lineman, Maintenance Electrician and Journeyman Industrial Electrician licenses must submit documentation proving the required amount of on-the-job-training.\n\n(2) Applicants for contractor's licenses must submit proof of general liability insurance and either workers' compensation insurance or a certificate of authority to self insure, or a statement that the applicant has elected not to obtain workers' compensation insurance pursuant to Subchapter A, Chapter 406, Labor Code, with the initial and renewal applications.\n\n(3) Applicants for contractor's licenses must submit proof of ownership of the business entity and provide documentation of the sponsoring master licensee in a manner prescribed by the department.\n\n(4) An applicant for a journeyman lineman license must submit documentation proving the required amount of training in an apprenticeship program or the required amount of experience as a journeyman lineman.\n\n(b) An applicant must complete all requirements within one year of the date the application is filed.\n\n(c) Each applicant must meet the applicable eligibility requirements as set forth in Texas Occupations Code, §§1305.153-1305.1618.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "30": {
    "content": "73.21. Licensing Requirements—Examinations.\n\n(Effective March 1, 2004, 29 TexReg 1653; amended effective October 20, 2005, 30 TexReg 6730; amended effective December 1, 2007, 32 TexReg 8477; amended effective January 1, 2010, 34 TexReg 9433)\n\n(a) To obtain a license by examination issued under this chapter:\n\n(1) An individual applicant must submit a completed application, all necessary documentation, and appropriate fees to the Texas Department of Licensing and Regulation for review and determination of examination eligibility.\n\n(2) An individual applicant must achieve a passing score on an examination approved by the executive director of the Texas Department of Licensing and Regulation.\n\n(b) To obtain a license without examination, an applicant must have been licensed for the preceding year by a municipality or regional licensing authority that has terminated its licensing program and have applied for a state issued license within ninety days of the date the program stopped issuing or renewing licenses.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "31": {
    "content": "73.22. Licensing Requirements—General.\n\n(Effective March 1, 2004, 29 TexReg 1653; amended effective October 20, 2005, 30 TexReg 6730; amended effective December 1, 2007, 32 TexReg 8477; amended effective January 1, 2010, 34 TexReg 9433)\n\n(a) A license issued under this chapter is valid for one year from the date of issuance and must be renewed annually.\n\n(b) A person shall not perform electrical work requiring a license under Title 8, Texas Occupations Code, Chapter 1305 with an expired license.\n\n(c) Falsifying information on an application, obtaining a license by fraud or false representation, or cheating on an examination is grounds for denial, suspension, or revocation of a license and/or an administrative penalty.\n\n(d) An electrical contractor, an electrical sign contractor, or a residential appliance installation contractor shall not use a license number that is not assigned to that contractor by the department.\n\n(e) A license is not transferable.\n\n(f) Altering a license in any way is prohibited and is grounds for a sanction and/or penalty.\n\n(g) If a licensee contracts with a general contractor or a home warranty company to provide installation or service that requires a license under the Act, the licensee remains responsible for the integrity of that work.\n\n(h) A person using the license of another person or allowing another person to use his license shall be subject to license denial, suspension, or revocation and/or assessment of an administrative penalty.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "32": {
    "content": "73.23. Licensing Requirements--Renewal.\n\n(a) Non-receipt of a license renewal notice from the department does not exempt a person, or entity, from any requirements of this chapter.\n\n(b) A complete request for renewal must be filed on the form approved by the department and includes all required fees by the expiration date to maintain continuous licensure.\n\n(c) Applications not filed by the expiration date are considered applications for late renewal and are subject to late renewal fees.\n\n(d) Licenses issued from a late renewal application will have an unlicensed period from the expiration date of the previous license to the issuance date of the renewed license. Electrical work that requires a license issued under this chapter shall not be performed during the unlicensed period.\n\n73.24. Licensing Requirements--Waiver of Examination Requirements.\n\n(a) An applicant who is licensed in another state that has entered into a reciprocity agreement with Texas regarding licensure of electricians, sign electricians, journeyman linemen, journeyman industrial electricians, or residential appliance installers may obtain an equivalent license in Texas without passing the examination, provided that all other licensure requirements are met, as defined by Texas Occupations Code, Chapter 1305.\n\n(b) The examination requirement is waived if, based upon acceptable proof, the executive director determines that the provisions of §73.21(b) are met.\n\n(c) Acceptable proof of an applicant's qualifications must be presented on a form prescribed by the department that:\n\n(1) certifies completion of the required hours of on-the-job training under the supervision of a master electrician or master sign electrician as appropriate, or\n\n(2) is completed by the municipality or region in which the applicant was licensed for at least one year.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "33": {
    "content": "73.25. Continuing Education.\n\n(a) Terms used in this section have the meanings assigned by Chapter 59 of this title, unless the context indicates otherwise.\n\n(b) For each renewal, an electrical apprentice, electrical sign apprentice, journeyman electrician, master electrician, journeyman sign electrician, master sign electrician, residential wireman, journeyman lineman, maintenance electrician, or journeyman industrial electrician must complete four hours of continuing education in:\n\n(1) the National Electrical Code, as adopted under Title 8, Occupations Code §1305.101, or the current version of the National Electrical Code, as approved by the National Fire Protection Association (NFPA);\n\n(2) state law and rules that regulate the conduct of licensees; and\n\n(3) safety as defined in the National Fire Protection Association (NFPA) 70E.\n\n(c) In lieu of taking four hours of continuing education as required in §73.25(b), an electrical apprentice or electrical sign apprentice may enroll in a department-registered apprenticeship training program.\n\n(d) In the case of timely renewal, the continuing education hours must have been completed, or enrollment must have occurred in a department-registered apprenticeship training program, within the term of the current license. For a late renewal, the continuing education hours must have been completed, or enrollment must have occurred in a department-registered apprenticeship training program, within one year prior to the date of renewal.\n\n(e) A licensee may not receive continuing education credit for attending the same course more than once.\n\n(f) A licensee shall retain a copy of the certificate of completion for a course for one year after the date of completion. In conducting any inspection or investigation of the licensee, the department may examine the licensee’s records to determine compliance with this subsection.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "34": {
    "content": "(g) To be approved under Chapter 59 of this title, a provider’s course must be dedicated to instruction in:\n\n(1) the National Electrical Code, as adopted under Title 8, Occupations Code §1305.101, or the current version of the National Electrical Code, as approved by the National Fire Protection Association (NFPA);\n\n(2) state law and rules that regulate the conduct of licensees; and\n\n(3) safety as defined in the National Fire Protection Association (NFPA) 70E.\n\n(h) To register an apprenticeship training program with the department, a program must:\n\n(1) file a completed application in a form approved by the department;\n\n(2) provide proof to the department that the program is:\n\n(A) recognized by the Texas Workforce Commission or the Texas Higher Education Coordinating Board;\n\n(B) registered with the United States Department of Labor; or\n\n(C) a competency-based standardized craft-training program that meets the training program standards of the United States Department of Labor Office of Apprenticeship; and\n\n(3) pay the required application fee shown in §73.80.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "35": {
    "content": "(i) A department-registered apprentice training program must maintain the following documents for 24 months after a participant is no longer enrolled in the program:\n\n(1) participant’s program application;\n\n(2) proof of participant’s program completion;\n\n(3) participant’s leave of absence, resignation or termination; and\n\n(4) other documentation effecting participant’s enrollment.\n\n(j) A department-registered apprentice training program must submit to the department proof of a participant’s change in enrollment status within two days of the change. The proof must be in a form approved by the department.\n\n(k) A department-registered apprentice training program must comply with the requirements of the Act and this chapter and must maintain the requirement of subsection (h)(2).\n\n(l) A department-registered apprentice training program must annually notify the department, in a form approved by the department, of its intention to continue as a registered program.\n\n(m) A department-registered apprentice training program must immediately notify the department if it ceases to be registered. The notice must be in a form approved by the department.\n\n(n) The provisions listed in subsections (b), (c), and (d) are effective for electrical sign apprentice licenses that expire on or after September 1, 2012, and all other licenses, that expire on or after September 1, 2010.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "36": {
    "content": "73.26. Documentation of Required On-The-Job Training.\n\n(a) An applicant for a license which requires on-the-job training under Occupations Code Chapter 1305 may verify that he or she has completed on-the-job training by submitting the department's experience verification form with the license application.\n\n(b) When an applicant or the department requests verification of on-the-job training of an applicant from a licensee who is authorized by Occupations Code Chapter 1305 to verify on-the-job training, the licensee must provide the verification within 30 calendar days of the request. The licensee must verify only on-the-job training within the licensee's knowledge. The licensee must verify the dates of on-the-job training, describe the work performed by the applicant, specify the name of the business under which the applicant's work was performed, and provide any other information required on the department's form.\n\n(c) An applicant for a journeyman lineman license must verify that he or she has completed the apprenticeship required by Occupations Code Chapter 1305 by submitting verification in a form acceptable to the department.\n\n(d) An applicant for a residential wireman license who has completed a career and technology education program must verify completion by submitting verification in a form acceptable to the department.\n\n73.27. Licensing Requirements--Temporary Apprentices.\n\n(a) An applicant for a license as an electrical apprentice or an electrical sign apprentice will be issued a temporary apprentice license, if the applicant:\n\n(1) has not been convicted of a criminal offense; and,\n\n(2) pays the required fee.\n\n(b) A temporary license is valid for 21 days and may not be renewed.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "37": {
    "content": "73.28. Licensing Requirements--Emergency Licenses.\n\n(a) The executive director may grant emergency electrician licenses when:\n\n(1) in response to an emergency as defined by Gov. Code, §418.004, a state of disaster is declared by;\n\n(A) the Governor pursuant to Gov. Code, §418.014; or,\n\n(B) the presiding officer of the governing body of a local governmental entity pursuant to Gov. Code, §418.108, and,\n\n(2) the executive director determines that a sufficient number of persons holding electrical licenses recognized under Texas Occupations Code, Chapter 1305 is not available to perform electrical work needed to timely respond to the disaster.\n\n(b) To obtain an emergency license, an applicant must:\n\n(1) be currently licensed by another state of the United States to perform electrical work in the licensing state; and,\n\n(2) submit a completed application on a form acceptable to the department, along with appropriate attachments and the required fee.\n\n(c) Emergency licenses will be classified as master, master sign, journeyman, journeyman sign, residential wireman, journeyman lineman, or maintenance electrician and will be issued to applicants at a level equivalent to the license the applicant holds in another state.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "38": {
    "content": "(d) An emergency license will expire ninety days after issuance, and:\n\n(1) is valid only in the disaster area designated by the governor, or in the jurisdiction of a local governmental entity declaring a disaster;\n\n(2) is valid only during the time of a declared disaster and its declared recovery period, if any; and\n\n(3) may be renewed for an additional ninety days if:\n\n(A) the declared disaster and any applicable recovery period continue on the eightieth day of the emergency license;\n\n(B) the executive director determines, at that time, that a sufficient number of persons holding electrical licenses recognized under Texas Occupations Code, Chapter 1305 is not available to perform electrical work needed to timely respond to the disaster; and,\n\n(C) submits a completed renewal application on a form acceptable to the department, along with appropriate attachments and the required fee.\n\n(e) A person holding an emergency license must perform electrical work:\n\n(1) on behalf of an electrical contractor, an electrical sign contractor, or an employing governmental entity; and,\n\n(2) in compliance with all applicable statutes, administrative rules, and ordinances.\n\n(f) The fee for emergency licenses will be the amount set out in §73.80 for the class of emergency license issued.\n\nFor more information about TDLR Electrician Rules visit Website at\n\nhttps://www.tdlr.texas.gov/electricians/elecrules.htm#7328",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  }
}
