{
  "1": {
    "content": "ELECTRICIANS\nOccupations Code\nChapter 1305\nAdministered by the Texas Department of Licensing and Regulation\n(Effective April, 2025).\n\nSUBCHAPTER A. GENERAL PROVISIONS\n\nSec. 1305.001. SHORT TITLE.\nThis chapter may be cited as the Texas Electrical Safety and Licensing Act.\n\nSec. 1305.002. DEFINITIONS.\n\nIn this chapter:\n\n(1) \"Advisory board\" means the Electrical Safety and Licensing Advisory Board.\n\n(1-a) \"Agricultural use\" means a use or activity involving agriculture, as defined by Section 11.002, Water Code, other than the processing of an agricultural commodity.\n\n(1-b) \"Apprenticeship training program\" means an electrical training program that is:\n(A) recognized by the Texas Workforce Commission or the Texas Higher Education Coordinating Board;\n(B) registered with the United States Department of Labor; or\n(C) a competency-based standardized craft training program that meets the training program standards of the United States Department of Labor Office of Apprenticeship.\n\n(2) \"Commission\" means the Texas Commission of Licensing and Regulation.\n\n(3) \"Department\" means the Texas Department of Licensing and Regulation.\n\n(4) \"Electrical code\" means the National Electrical Code published by the National Fire Protection Association as adopted by the commission.\n\n(5) \"Electrical contracting\" means the business of designing, installing, erecting, repairing, or altering electrical wires or conductors to be used for light, heat, power, or signaling purposes. The term includes the installation or repair of ducts, raceways, or conduits for the reception or protection of wires or conductors and the installation or repair of any electrical machinery, apparatus, or system used for electrical light, heat, power, or signaling.\n\n(6) \"Electrical contractor\" means a person engaged in electrical contracting.\n\n(7) \"Electrical engineer\" means a person licensed under Chapter 1001 who possesses the necessary qualifications, training, and technical knowledge to perform electrical engineering work in this state.\n\n(8) \"Electrical inspector\" means a person certified by the International Association of Electrical Inspectors or International Code Council.\n\n(9) \"Electrical sign contracting\" means the business of designing, manufacturing, installing, connecting, reconnecting, or servicing an electric sign, cold cathode, neon gas tubing, or outline gas tubing, or altering electric sign wiring or conductors either inside or outside of a building.",
    "audio": "https://drive.google.com/file/d/1gUDgv61HiADhCuzvGcCgeUsjJUNbLjwU/view?usp=drive_link"
  },
  "2": {
    "content": "(10) \"Electrical sign contractor\" means a person engaged in electrical sign contracting.\n\n(11) \"Electrical work\" means any labor or material used in installing, maintaining, or extending an electrical wiring system and the appurtenances, apparatus, or equipment used in connection with the use of electrical energy in, on, outside, or attached to a building, residence, structure, property, or premises. The term includes service entrance conductors as defined by the National Electrical Code.\n\n(11-a) \"Executive director\" means the executive director of the department.\n\n(11-b) \"Journeyman industrial electrician\" means an individual who engages in electrical work exclusively at a business that operates a chemical plant, petrochemical plant, refinery, natural gas plant, natural gas treating plant, pipeline, or oil and gas exploration and production operation.\n\n(12) \"Journeyman lineman\" means an individual who engages in electrical work involving the maintenance and operation of equipment associated with the transmission and distribution of electricity from the electricity's original source to a substation for further distribution.\n\n(12-a) \"Residential appliance\" means:\n\n(A) equipment that:\n\n(i) is installed as a unit in a single-family or multifamily dwelling that does not exceed four stories;\n(ii) is directly connected to an electrical circuit; and\n(iii) performs a specific function; or\n\n(B) a pool-related electrical device.\n\n(12-b) \"Residential appliance installation\" means electrical work that is limited to the connection or disconnection of a residential appliance, including a pool-related electrical device, to an existing electrical circuit other than by inserting or removing a plug from an electrical outlet.\n\n(12-c) \"Residential appliance installation contracting\" means the business of residential appliance installation, including pool-related electrical maintenance.",
    "audio": "https://drive.google.com/file/d/1SAGshmDcJaEF59B9RAD8_Oq9DnmldR-j/view?usp=drive_link"
  },
  "3": {
    "content": "(12-d) \"Residential appliance installation contractor\" means a business entity, other than an electrical contractor or electrical sign contractor, that is engaged in residential appliance installation contracting, including pool-related electrical maintenance.\n\n(12-e) \"Residential appliance installer\" means a person, other than a licensed electrician, who is licensed to perform residential appliance installation, including pool-related electrical maintenance.\n\n(13) \"Residential wireman\" means a person licensed under this chapter who may only perform electrical installations in single-family and multifamily dwellings not exceeding four stories.\n\n(14) \"Pool\" means an outdoor or indoor structure that is located at a residential property, a business property, or a property owned by a municipality and that is intended for swimming or recreational bathing, including an inground structure, aboveground structure, hot tub, spa, portable spa, or non-portable wading pool.\n\n(15) \"Pool-related electrical device\" means equipment for a pool that:\n\n(A) is installed as a unit;\n(B) is directly connected to an electrical circuit;\n(C) performs a specific function; and\n(D) uses single-phase power of 240 volts or less.\n\n(16) \"Pool-related electrical maintenance\" means electrical work that is limited to the connection or disconnection of a pool-related electrical device to an existing electrical circuit other than by inserting or removing a plug from an electrical outlet.\n\nAdded by Acts 2003, 78th Leg., ch. 1062, Sec. 1, eff. Sept. 1, 2003.\n\nAmended by Acts 2005, 79th Leg., Ch. 1052 (H.B. 1317), Sec. 1, eff. June 18, 2005.\n\nAmended by Acts 2007, 80th Leg., R.S., Ch. 418 (S.B. 1222), Sec. 1, eff. September 1, 2007.\n\nAmended by Acts 2009, 81st Leg., R.S., Ch. 416 (H.B. 1973), Sec. 1, eff. March 1, 2010.\n\nAmended by Acts 2009, 81st Leg., R.S., Ch. 741 (S.B. 470), Sec. 1, eff. September 1, 2009.\n\nAmended by Acts 2009, 81st Leg., R.S., Ch. 1392 (S.B. 1982), Sec. 1, eff. March 1, 2010.\n\nAmended by Acts 2011, 82nd Leg., R.S., Ch. 452 (S.B. 1630), Sec. 1, eff. June 17, 2011.\n\nAmended by Acts 2013, 83rd Leg., R.S., Ch. 882 (H.B. 796), Sec. 1, eff. June 14, 2013.\n\nAmended by Acts 2017, 85th Leg., R.S., Ch. 826 (H.B. 1698), Sec. 1, eff. September 1, 2017.",
    "audio": "https://drive.google.com/file/d/1kQ_GBVjl2fSqj7aUsWpAmPcPSaJVnpId/view?usp=drive_link"
  },
  "4": {
    "content": {
      "text": "Sec. 1305.003. EXEMPTIONS; APPLICATION OF CHAPTER.\n\n(a) This chapter does not apply to:\n\n(1) the installation of electrical equipment in a ship, watercraft other than a floating building, railway rolling stock, aircraft, motor vehicle, or recreational vehicle;\n\n(2) the installation of electrical equipment underground in a mine and in self-propelled mobile surface mining machinery and its attendant electrical trailing cable;\n\n(3) the installation of electrical equipment for generation, transformation, transmission, or distribution of power used exclusively to operate railway rolling stock or exclusively for signaling and communications purposes;\n\n(4) the installation, maintenance, alteration, or repair of communications equipment provided by a telecommunications provider;\n\n(5) the installation, maintenance, alteration, or repair of electrical equipment under the exclusive control of an electric utility, power generation company as defined by Sections 31.002(1) and (10), Utilities Code, electric cooperative, or municipally owned utility and used for communications or metering, or for the generation, control, transformation, transmission, and distribution of electrical energy, and located:\n\n(A) in a building used exclusively by a utility or power generation company for those purposes;\n\n(B) outdoors on property owned or leased by the utility or power generation company;\n\n(C) on public highways, streets, roads, or other public rights-of-way; or\n\n(D) outdoors by established rights in vaults or on private property;\n\n(6) work not specifically regulated by a municipal ordinance that is performed in or on a dwelling by a person who owns and resides in the dwelling;\n\n(7) work involved in the manufacture of electrical equipment that includes the on-site and off-site manufacturing, commissioning, testing, calibrating, coordinating, troubleshooting, or evaluating of electrical equipment, the repairing or retrofitting of electrical equipment with components of the same ampacity, and the maintenance and servicing of electrical equipment within the equipment's enclosure that is performed by an authorized employee or authorized representative of an electrical equipment manufacturer and limited to the type of products manufactured by the manufacturer;",
      "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
    }
  }
}
