{
  "1": {
    "content": "Chapter 2 Wiring and Protection (continued)\n\nArticle 215-220\n\nArticle 215 Feeders\n\n215.1 Scope\n\nThis article covers the installation requirements, overcurrent protection requirements, minimum size, and ampacity of conductors for feeders not over 1000 volts ac or 1500 volts dc, nominal.\n\nInformational Note: See Part III of Article 235 for feeders over 1000 volts ac or 1500 volts dc.\n\n215.2 Minimum Rating and Size\n\n(A) General\n\nFeeder conductors shall have an ampacity not less than the larger of 215.2(A)(1) or (A)(2) and shall comply with 110.14(C).\n\n(1) Continuous and Noncontinuous Loads\n\nWhere a feeder supplies continuous loads or any combination of continuous and noncontinuous loads, the minimum feeder conductor size shall have an ampacity not less than the noncontinuous load plus 125 percent of the continuous load.\n\nException No. 1: If the assembly, including the overcurrent devices protecting the feeder(s), is listed for operation at 100 percent of its rating, the ampacity of the feeder conductors shall be permitted to be not less than the sum of the continuous load plus the noncontinuous load.\n\nException No. 2: Where a portion of a feeder is connected at both its supply and load ends to separately installed pressure connections as covered in 110.14(C)(2), it shall be permitted to have an ampacity not less than the sum of the continuous load plus the noncontinuous load. No portion of a feeder installed under this exception shall extend into an enclosure containing either the feeder supply or the feeder load terminations, as covered in 110.14(C)(1).\n\nException No. 3: Grounded conductors that are not connected to an overcurrent device shall be permitted to be sized at 100 percent of the continuous and noncontinuous load.\n\n(2) Ampacity Adjustment or Correction Factors\n\nThe minimum feeder conductor size shall have an ampacity not less than the maximum load to be served after the application of any adjustment or correction factors in accordance with 310.14.\n\nInformational Note No. 1: See Informative Annex D for Examples D1 through D11.\n\nInformational Note No. 2: Conductors for feeders, as defined in Article 100, sized to prevent a voltage drop exceeding 3 percent at the farthest outlet of power, heating, and lighting loads, or combinations of such loads, and where the maximum total voltage drop on both feeders and branch circuits to the farthest outlet does not exceed 5 percent, will provide reasonable efficiency of operation.\n\nInformational Note No. 3: See 210.19, Informational Note for voltage drop for branch circuits.\n\n(B) Grounded Conductor\n\nThe size of the feeder circuit grounded conductor shall not be smaller than the equipment grounding conductor size required by 250.122, except that 250.122(F) shall not apply where grounded conductors are run in parallel.\n\nAdditional minimum sizes shall be as specified in 215.2(C) under the conditions stipulated.\n\n(C) Ampacity Relative to Service Conductors\n\nThe feeder conductor ampacity shall not be less than that of the service conductors where the feeder conductors carry the total load supplied by service conductors with an ampacity of 55 amperes or less.",
    "audio": "https://drive.google.com/file/d/1gUDgv61HiADhCuzvGcCgeUsjJUNbLjwU/view?usp=drive_link"
  },
  "2": {
    "content": "215.3 Overcurrent Protection\n\nFeeders shall be protected against overcurrent in accordance with Part I of Article 240. Where a feeder supplies continuous loads or any combination of continuous and noncontinuous loads, the rating of the overcurrent device shall not be less than the noncontinuous load plus 125 percent of the continuous load.\n\nException: Where the assembly, including the overcurrent devices protecting the feeder(s), is listed for operation at 100 percent of its rating, the ampere rating of the overcurrent device shall be permitted to be not less than the sum of the continuous load plus the noncontinuous load.\n\n215.4 Feeders With Common Neutral Conductor\n\n(A) Feeders With Common Neutral\n\nUp to three sets of 3-wire feeders or two sets of 4-wire or 5-wire feeders shall be permitted to utilize a common neutral.\n\n(B) In Metal Raceway or Enclosure\n\nWhere installed in a metal raceway or other metal enclosure, all conductors of all feeders using a common neutral conductor shall be enclosed within the same raceway or other enclosure as required in 300.20.\n\n215.5 Diagrams of Feeders\n\nIf required by the authority having jurisdiction, a diagram showing feeder details shall be provided prior to the installation of the feeders. Such a diagram shall show the area in square feet of the building or other structure supplied by each feeder, the total calculated load before applying demand factors, the demand factors used, the calculated load after applying demand factors, and the size and type of conductors to be used.\n\n215.6 Feeder Equipment Grounding Conductor\n\nWhere a feeder supplies branch circuits in which equipment grounding conductors are required, the feeder shall include or provide an equipment grounding conductor, to which the equipment grounding conductors of the branch circuits shall be connected. Where the feeder supplies a separate building or structure, the requirements of 250.32 shall apply.\n\n215.7 Ungrounded Conductors Tapped From Grounded Systems\n\nTwo-wire dc circuits and ac circuits of two or more ungrounded conductors shall be permitted to be tapped from the ungrounded conductors of circuits having a grounded neutral conductor. Switching devices in each tapped circuit shall have a pole in each ungrounded conductor.\n\n215.9 Ground-Fault Circuit-Interrupter Protection for Personnel\n\nFeeders shall be permitted to be protected by a listed ground-fault circuit interrupter installed in a readily accessible location in lieu of the provisions for such interrupters as specified in 210.8 and 590.6(A).",
    "audio": "https://drive.google.com/file/d/1SAGshmDcJaEF59B9RAD8_Oq9DnmldR-j/view?usp=drive_link"
  },
  "3": {
    "content": "215.10 Ground-Fault Protection of Equipment\n\nEach feeder disconnect rated 1000 amperes or more and installed on solidly grounded wye electrical systems of more than 150 volts to ground, but not exceeding 1000 volts phase-to-phase, shall be provided with ground-fault protection of equipment in accordance with 230.95.\n\nInformational Note: See 517.17 for buildings that contain health care occupancies.\n\nException No. 1: This section shall not apply to a disconnecting means for a continuous industrial process where a nonorderly shutdown will introduce additional or increased hazards.\n\nException No. 2: This section shall not apply if ground-fault protection of equipment is provided on the supply side of the feeder and on the load side of any transformer supplying the feeder.\n\nException No. 3: If temporary feeder conductors are used to connect a generator to a facility for repair, maintenance, or emergencies, ground-fault protection of equipment shall not be required. Temporary feeders without ground-fault protection shall be permitted for the time period necessary but shall not exceed 90 days.\n\n215.11 Circuits Derived From Autotransformers\n\nFeeders shall not be derived from autotransformers unless the system supplied has a grounded conductor that is electrically connected to a grounded conductor of the system supplying the autotransformer.\n\nException No. 1: An autotransformer shall be permitted without the connection to a grounded conductor where transforming from a nominal 208 volts to a nominal 240-volt supply or similarly from 240 volts to 208 volts.\n\nException No. 2: In industrial occupancies, where conditions of maintenance and supervision ensure that only qualified persons service the installation, autotransformers shall be permitted to supply nominal 600-volt loads from nominal 480-volt systems, and 480-volt loads from nominal 600-volt systems, without the connection to a similar grounded conductor.",
    "audio": "https://drive.google.com/file/d/1kQ_GBVjl2fSqj7aUsWpAmPcPSaJVnpId/view?usp=drive_link"
  },
  "4": {
    "content": "215.12 Identification for Feeders\n\n(A) Grounded Conductor\n\nThe grounded conductor of a feeder, if insulated, shall be identified in accordance with 200.6.\n\n(B) Equipment Grounding Conductor\n\nThe equipment grounding conductor shall be identified in accordance with 250.119.\n\n(C) Identification of Ungrounded Conductors\n\nUngrounded conductors shall be identified in accordance with 215.12(C)(1) or (C)(2), as applicable.\n\n(1) Feeders Supplied From More Than One Nominal Voltage System\n\nWhere the premises wiring system has feeders supplied from more than one nominal voltage system, each ungrounded conductor of a feeder shall be identified by phase or line and system at all termination, connection, and splice points in compliance with 215.12(C)(1)(a) and (C)(1)(b).\n\nMeans of Identification. The means of identification shall be permitted to be by separate color coding, marking tape, tagging, or other approved means.\n\nPosting of Identification Means. The method utilized for conductors originating within each feeder panelboard or similar feeder distribution equipment shall be documented in a manner that is readily available or shall be permanently posted at each feeder panelboard or similar feeder distribution equipment.\n\n(2) Feeders Supplied From Direct-Current Systems\n\nWhere a feeder is supplied from a dc system operating at more than 60 volts, each ungrounded conductor of 4 AWG or larger shall be identified by polarity at all termination, connection, and splice points by marking tape, tagging, or other approved means; each ungrounded conductor of 6 AWG or smaller shall be identified by polarity at all termination, connection, and splice points in compliance with 215.12(C)(2)(a) and (C)(2)(b). The identification methods utilized for conductors originating within each feeder panelboard or similar feeder distribution equipment shall be documented in a manner that is readily available or shall be permanently posted at each feeder panelboard or similar feeder distribution equipment.\n\nPositive Polarity, Sizes 6 AWG or Smaller. Where the positive polarity of a dc system does not serve as the connection for the grounded conductor, each positive ungrounded conductor shall be identified by one of the following means:\n\nA continuous red outer finish\nA continuous red stripe durably marked along the conductor's entire length on insulation of a color other than green, white, gray, or black\nImprinted plus signs (+) or the word POSITIVE or POS durably marked on insulation of a color other than green, white, gray, or black, and repeated at intervals not exceeding 610 mm (24 in.) in accordance with 310.8(B)\nAn approved permanent marking means such as sleeving or shrink-tubing that is suitable for the conductor size, at all termination, connection, and splice points, with imprinted plus signs (+) or the word POSITIVE or POS durably marked on insulation of a color other than green, white, gray, or black\n\nNegative Polarity, Sizes 6 AWG or Smaller. Where the negative polarity of a dc system does not serve as the connection for the grounded conductor, each negative ungrounded conductor shall be identified by one of the following means:\n\nA continuous black outer finish\nA continuous black stripe durably marked along the conductor's entire length on insulation of a color other than green, white, gray, or red\nImprinted minus signs (—) or the word NEGATIVE or NEG durably marked on insulation of a color other than green, white, gray, or red, and repeated at intervals not exceeding 610 mm (24 in.) in accordance with 310.8(B)\nAn approved permanent marking means such as sleeving or shrink-tubing that is suitable for the conductor size, at all termination, connection, and splice points, with imprinted minus signs (—) or the word NEGATIVE or NEG durably marked on insulation of a color other than green, white, gray, or red",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "5": {
    "content": "215.15 Barriers\n\nBarriers shall be placed such that no energized, uninsulated, ungrounded busbar or terminal is exposed to inadvertent contact by persons or maintenance equipment while servicing load terminations in panelboards, switchboards, switchgear, or motor control centers supplied by feeder taps in 240.21(B) or transformer secondary conductors in 240.21(C) when the disconnecting device, to which the tap conductors are terminated, is in the open position.\n\n215.18 Surge Protection\n\n(A) Surge-Protective Device\n\nWhere a feeder supplies any of the following, a surge-protective device (SPD) shall be installed:\n\n1. Dwelling units\n2. Dormitory units\n3. Guest rooms and guest suites of hotels and motels\n4. Areas of nursing homes and limited-care facilities used exclusively as patient sleeping rooms\n\n(B) Location\n\nThe SPD shall be installed in or adjacent to distribution equipment, connected to the load side of the feeder, that contains branch circuit overcurrent protective device(s) that supply the locations specified in 215.18(A).\n\nInformational Note: Surge protection is most effective when closest to the branch circuit. Surges can be generated from multiple sources including, but not limited to, lightning, the electric utility, or utilization equipment.\n\n(C) Type\n\nThe SPD shall be a Type 1 or Type 2 SPD.\n\n(D) Replacement\n\nWhere the distribution equipment supplied by the feeder is replaced, all of the requirements of this section shall apply.\n\n(E) Ratings\n\nSPDs shall have a nominal discharge current rating (In) of not less than 10kA.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "6": {
    "content": "Article 220 Branch-Circuit, Feeder, and Service Load Calculations\n\nPart I General\n\n220.1 Scope\n\nThis article provides requirements for calculating branch-circuit, feeder, and service loads. Part I provides general requirements for calculation methods. Part II provides calculation methods for branch-circuit loads. Part III and Part IV provide calculation methods for feeder and service loads. Part V provides calculation methods for farm loads. Part VI provides calculation methods for health care facilities. Part VII provides calculation methods for marinas, boatyards, floating buildings, and commercial and noncommercial docking facilities.\n\nInformational Note No. 1: See Informative Annex D for examples.\n\nInformational Note No. 2: See Informational Note Figure 220.1 for information on the organization of this article.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link",
    "img": "placeholder",
    "caption": "Informational Note Figure 220.1 Branch-Circuit, Feeder, and Service Load Calculation Methods."
  },
  "7": {
    "content": "220.3 Other Articles for Specific-Purpose Calculations\n\nTable 220.3 shall provide references for specific-purpose calculation requirements not located in Chapters 5, 6, or 7 that amend or supplement the requirements of this article.\n\nTable 220.3 Specific-Purpose Calculation References\n\nCalculation\n\nArticle\n\nSection (or Part)\n\nAir-conditioning and refrigerating equipment, branch-circuit conductor sizing\n440\nPart IV\n\nCapacitors\n460\n460.8\n\nFixed electric heating equipment for pipelines and vessels, branch-circuit sizing\n427\n427.4\n\nFixed electric space-heating equipment, branch-circuit sizing\n424\n424.3\n\nFixed outdoor electric deicing and snow-melting equipment, branch-circuit sizing\n426\n426.4\n\nFixed resistance and electrode industrial process heating equipment\n425\n425.4\n\nMotors, feeder demand factor\n430\n430.26\n\nMotors, multimotor and combination-load equipment\n430\n430.25\n\nMotors, several motors or a motor(s) and other load(s)\n430\n430.24\n\nOver 1000-volt ac and 1500-volt dc branch-circuit calculations\n235\n235.19\n\nOver 1000-volt feeder calculations\n215\n215.2(B)\n\nPhase converters, conductors\n455\n455.6\n\nStorage-type water heaters\n422\n422.11\n\n\n220.5 Calculations\n\n(A) Voltages\n\nUnless other voltages are specified, for purposes of calculating branch-circuit and feeder loads, nominal system voltages of 120, 120/240, 208Y/120, 240, 347, 480Y/277, 480, 600Y/347, and 600 volts shall be used.\n\n(B) Fractions of an Ampere\n\nCalculations shall be permitted to be rounded to the nearest whole ampere, with decimal fractions smaller than 0.5 dropped.\n\n(C) Floor Area\n\nThe floor area for each floor shall be calculated from the outside dimensions of the building, dwelling unit, or other area involved. For dwelling units, the calculated floor area shall not include open porches or unfinished areas not adaptable for future use as a habitable room or occupiable space.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "8": {
    "content": "Part II Branch-Circuit Load Calculations\n\n220.10 General\n\nBranch-circuit loads shall be calculated in accordance with the following sections:\n\n220.14 for other loads - all occupancies\n220.16 for additions to existing installations\n220.41 for dwelling units\n220.42 for lighting loads for non-dwelling occupancies\n220.44 for hotel and motel occupancies\n\n220.11 Maximum Load\n\nThe total load on a branch circuit shall not exceed the rating of the branch circuit nor the maximum loads specified in 220.11(A) through (C) under the conditions specified therein.\n\n(A) Motor-Operated and Combination Loads\n\nWhere a circuit supplies only motor-operated loads, the conductor sizing requirement specified in 430.22 shall apply. Where a circuit supplies only air-conditioning equipment, refrigerating equipment, or both, the requirements of 440.6 shall apply. For circuits supplying loads consisting of motor-operated utilization equipment that is fastened in place and has a motor larger than 1/8 hp in combination with other loads, the total calculated load shall be based on 125 percent of the largest motor load plus the sum of the other loads in accordance with 430.24.\n\n(B) Inductive and LED Lighting Loads\n\nFor circuits supplying lighting units that have ballasts, transformers, autotransformers, or LED drivers, the calculated load shall be based on the total ampere ratings of such units and not on the total watts of the lamps.\n\n(C) Electric Cooking Appliances\n\nApplying demand factors for ranges, wall-mounted ovens, counter-mounted cooking units, and other household cooking appliance loads in excess of 1¾ kW shall be permitted in accordance with Table 220.55, including Notes 4, 5, and 6.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "9": {
    "content": "220.14 Other Loads - All Occupancies\n\nBranch-circuit load calculations shall include calculation of a minimum load on each outlet as calculated in 220.14(A) through (K) and then summed to establish the load on the branch circuit.\n\nIn all occupancies, the minimum load for each outlet for general-use receptacles and outlets not used for general illumination shall not be less than that calculated in 220.14(A) through (K), with the loads shown being based on nominal branch-circuit voltages.\n\nException: The loads of outlets serving switchboards and switching frames in telephone exchanges shall be waived from the calculations.\n\n(A) Specific Appliances or Loads\n\nAn outlet for a specific appliance or other load not covered in 220.14(B) through (K) shall be calculated based on the ampere rating of the appliance or load served.\n\n(B) Electric Dryers and Electric Cooking Appliances in Dwellings and Household Cooking Appliances Used in Instructional Programs\n\nLoad calculations shall be permitted as specified in 220.54 for electric dryers and in 220.55 for electric ranges and other cooking appliances.\n\n(C) Motor Outlets\n\nThe conductor sizing requirements specified in 430.22, 430.24, and 440.6 shall be used to determine the loads for motor outlets.\n\n(D) Luminaires\n\nAn outlet supplying a luminaire(s) shall be calculated based on the maximum volt-ampere rating of the equipment and lamps for which the luminaire(s) is rated.\n\n(E) Heavy-Duty Lampholders\n\nOutlets for heavy-duty lampholders shall be calculated at a minimum of 600 volt-amperes.\n\n(F) Sign and Outline Lighting\n\nSign and outline lighting outlets shall be calculated at a minimum of 1200 volt-amperes for each required branch circuit specified in 600.5(A).\n\n(G) Show Windows\n\nShow windows shall be calculated in accordance with either of the following:\n\nThe unit load per outlet as required in other provisions of this section\nAt 200 volt-amperes per linear 300 mm (1 ft) of show window",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "10": {
    "content": "H) Fixed Multioutlet Assemblies\n\nFixed multioutlet assemblies used in other than dwelling units or the guest rooms or guest suites of hotels or motels shall be calculated in accordance with the following:\n\nWhere appliances are unlikely to be used simultaneously, each 1.5 m (5 ft) or fraction thereof of each separate and continuous length shall be considered as one outlet of not less than 180 volt-amperes.\nWhere appliances are likely to be used simultaneously, each 300 mm (1 ft) or fraction thereof shall be considered as an outlet of not less than 180 volt-amperes.\nFor the purposes of this section, the calculation shall be permitted to be based on the portion that contains receptacles.\n\n(I) Receptacle Outlets\n\nExcept as covered in 220.41 and 220.14(J), receptacle outlets shall be calculated at not less than 180 volt-amperes for each single or for each multiple receptacle on one yoke. A single piece of equipment consisting of a multiple receptacle comprised of four or more receptacles shall be calculated at not less than 90 volt-amperes per receptacle. This provision shall not be applicable to the receptacle outlets specified in 210.11(C)(1) and (C)(2).\n\n(J) Receptacle Outlets in Office Buildings\n\nIn office buildings, the receptacle loads shall be calculated to be the larger of the following:\n\nThe calculated load from 220.14(I)\n11 volt-amperes/m2 (1 volt-ampere/ft2)\n\n(K) Other Outlets\n\nOther outlets not covered in 220.14(A) through (J) shall be calculated based on 180 volt-amperes per outlet.\n\n220.16 Loads for Additions to Existing Installations\n\n(A) Dwelling Units\n\nLoads added to an existing dwelling unit(s) shall comply with the following as applicable:\n\nLoads for structural additions to an existing dwelling unit or for a previously unwired portion of an existing dwelling unit shall be calculated in accordance with 220.14.\nLoads for new circuits or extended circuits in previously wired dwelling units shall be calculated in accordance with 220.14.\n\n(B) Other Than Dwelling Units\n\nLoads for new circuits or extended circuits in other than dwelling units shall be calculated in accordance with either 220.42 or 220.14, as applicable.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "11": {
    "content": "Part III Feeder and Service Load Calculations\n\n220.40 General\n\nThe calculated load of a feeder or service shall not be less than the sum of the loads on the branch circuits supplied, as determined by Part II of this article, after any applicable demand factors permitted or required by Part III, IV, V, VI, or VII have been applied.\n\nInformational Note No. 1: See Informative Annex D, Examples D1(a) through D10, for examples of feeder and service load calculations.\n\nInformational Note No. 2: See 220.11(B) for the maximum load in amperes permitted for lighting units operating at less than 100 percent power factor.\n\n220.41 Dwelling Units, Minimum Unit Load\n\nIn one-family, two-family, and multifamily dwellings, the minimum unit load shall be not less than 33 volt-amperes/m2 (3 volt-amperes/ft2).\n\nUnit loads include the following lighting and receptacle outlets, and no additional load calculations shall be required:\n\nAll general-use receptacle outlets of 20-ampere rating or less, including receptacles connected to the circuits specified in 210.11(C)(3) and (C)(4)\nThe receptacle outlets specified in 210.52(E) and (G)\nThe lighting outlets specified in 210.70\nThe minimum lighting load shall be determined using the minimum unit load and the floor area as determined in 220.5(C) for dwelling occupancies. Motors rated less than 1/8 hp and connected to a lighting circuit shall be considered part of the minimum lighting load.\n\n220.42 Lighting Load for Non-Dwelling Occupancies\n\n(A) General\n\nA unit load of not less than that specified in Table 220.42(A) for non-dwelling occupancies and the floor area determined in 220.5(C) shall be used to calculate the minimum lighting load. Motors rated less than 1/8 HP and connected to a lighting circuit shall be considered general lighting load.\n\nInformational Note: The unit values of Table 220.42(A) are based on minimum load conditions and 80 percent power factor and might not provide sufficient capacity for the installation contemplated.\n\nTable 220.42(A) General Lighting Loads by Non-Dwelling Occupancy\n\nType of Occupancy | Unit Load | Volt-amperes/m2 | Volt-amperes/ft2\n--- | --- | --- | ---\nAutomotive facility | 16 | 16 | 1.5\nConvention center | 15 | 15 | 1.4\nCourthouse | 15 | 15 | 1.4\nDormitory | 16 | 16 | 1.5\nExercise center | 15 | 15 | 1.4\nFire station | 14 | 14 | 1.3\nGymnasium1 | 18 | 18 | 1.7\nHealth care clinic | 17 | 17 | 1.6\nHospital | 17 | 17 | 1.6\nHotel or motel, or apartment house without provisions for cooking by tenants2 | 18 | 18 | 1.7\nLibrary | 16 | 16 | 1.5\nManufacturing facility3 | 24 | 24 | 2.2\nMotion picture theater | 17 | 17 | 1.6\nMuseum | 17 | 17 | 1.6\nOffice4 | 14 | 14 | 1.3\nParking garage5 | 3 | 3 | 0.3\nPenitentiary | 13 | 13 | 1.2\nPerforming arts theater | 16 | 16 | 1.5\nPolice station | 14 | 14 | 1.3\nPost office | 17 | 17 | 1.6\nReligious facility | 24 | 24 | 2.2\nRestaurant6 | 16 | 16 | 1.5\nRetail7,8 | 20 | 20 | 1.9\nSchool/university | 16 | 16 | 1.5\nSports arena | 16 | 16 | 1.5\nTown hall | 15 | 15 | 1.4\nTransportation | 13 | 13 | 1.2\nWarehouse | 13 | 13 | 1.2\nWorkshop | 18 | 18 | 1.7\n\nNote: The 125 percent multiplier for a continuous load as specified in 210.20(A) is included, therefore no additional multiplier shall be required when using the unit loads in this table for calculating the minimum lighting load for a specified occupancy.\n\n1Armories and auditoriums are considered gymnasium-type occupancies.\n2Lodge rooms are similar to hotels and motels.\n3Industrial commercial loft buildings are considered manufacturing-type occupancies.\n4Banks are office-type occupancies.\n5Commercial (storage) garages are considered parking garage occupancies.\n6Clubs are considered restaurant occupancies.\n7Barber shops and beauty parlors are considered retail occupancies.\n8Stores are considered retail occupancies.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "12": {
    "content": "(B) Energy Code\n\nWhere the building is designed and constructed to comply with an energy code adopted by the local authority, the lighting load shall be permitted to be calculated using the unit values specified in the energy code where the following conditions are met:\n\nA power monitoring system is installed that will provide continuous information regarding the total general lighting load of the building.\nThe power monitoring system will be set with alarm values to alert the building owner or manager if the lighting load exceeds the values set by the energy code. Automatic means to take action to reduce the connected load shall be permitted.\nThe demand factors specified in 220.45 are not applied to the general lighting load.\nThe continuous load multiplier of 125 percent shall be applied.\n\n220.43 Office Buildings\n\nIn office buildings, the receptacle loads shall be calculated to be the larger of the following:\n\nThe calculated load from 220.14(I) after Table 220.47 demand factors have been applied\n11 volt-amperes/m2 or 1 volt-ampere/ft2\n\n220.44 Hotel and Motel Occupancies\n\nIn guest rooms or guest suites of hotels and motels, the following lighting and receptacle outlets are included in the minimum unit load in Table 220.42(A), and no additional load calculations shall be required for such outlets:\n\nAll general-use receptacle outlets of 20-ampere rating or less, including receptacles connected to the circuits in 210.11(C)(3) and (C)(4)\nThe receptacle outlets specified in 210.52(E)(3)\nThe lighting outlets specified in 210.70\n\n220.45 General Lighting\n\nThe demand factors specified in Table 220.45 shall apply to that portion of the total branch-circuit load calculated for general illumination. They shall not be applied in determining the number of branch circuits for general illumination.\n\nTable 220.45 Lighting Load Demand Factors\n\nType of Occupancy | Portion of Lighting Load to Which Demand Factor Applies (Volt-Amperes) | Demand Factor (%)\n--- | --- | ---\nDwelling units | First 3000 at | 100\n | From 3001 to 120,000 at | 35\n | Remainder over 120,000 at | 25\nHotels and motels, including apartment houses without provision for cooking by tenants* | First 20,000 or less at | 60\n | From 20,001 to 100,000 at | 50\n | Remainder over 100,000 at | 35\nWarehouses (storage) | First 12,500 or less at | 100\n | Remainder over 12,500 at | 50\nAll others | Total volt-amperes | 100\n\n*The demand factors of this table shall not apply to the calculated load of feeders or services supplying areas in hotels and motels where the entire lighting is likely to be used at one time, as in ballrooms or dining rooms.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "13": {
    "content": "210.12 Arc-Fault Circuit-Interrupter Protection\n\nArc-fault circuit-interrupter (AFCI) protection shall be installed in accordance with 210.12(B) through (E) by any of the means described in 210.12(A)(1) through (A)(6). The AFCI shall be listed and installed in a readily accessible location.\n\n(A) Means of Protection\n\nAFCI protection shall be provided by any of the following means:\n\n1. A listed combination-type AFCI installed to provide protection of the entire branch circuit.\n2. A listed branch/feeder-type AFCI installed at the origin of the branch circuit in combination with a listed outlet branch-circuit-type AFCI installed on the branch circuit at the first outlet box, which shall be marked to indicate that it is the first outlet of the branch circuit.\n3. A listed supplemental arc protection circuit breaker installed at the origin of the branch circuit in combination with a listed outlet branch-circuit-type AFCI installed on the branch circuit at the first outlet box if all of the following conditions are met:\n   - The branch-circuit wiring shall be continuous from the branch-circuit overcurrent device to the outlet branch-circuit AFCI.\n   - The maximum length of the branch-circuit wiring from the branch-circuit overcurrent device to the first outlet shall not exceed 15.2 m (50 ft) for a 14 AWG conductor or 21.3 m (70 ft) for a 12 AWG conductor.\n   - The first outlet box shall be marked to indicate that it is the first outlet of the branch circuit.\n4. A listed outlet branch-circuit-type AFCI installed on the branch circuit at the first outlet in combination with a listed branch-circuit overcurrent protective device if all of the following conditions are met:\n   - The branch-circuit wiring shall be continuous from the branch-circuit overcurrent device to the outlet branch-circuit AFCI.\n   - The maximum length of the branch-circuit wiring from the branch-circuit overcurrent device to the first outlet shall not exceed 15.2 m (50 ft) for a 14 AWG conductor or 21.3 m (70 ft) for a 12 AWG conductor.\n   - The first outlet box shall be marked to indicate that it is the first outlet of the branch circuit.\n   - The combination of the branch-circuit overcurrent device and outlet branch-circuit AFCI shall be identified as meeting the requirements for a system combination-type AFCI and listed as such.\n5. If metal raceway, metal wireways, metal auxiliary gutters, or Type MC or Type AC cable meeting the applicable requirements of 250.118, with metal boxes, metal conduit bodies, and metal enclosures are installed for the portion of the branch circuit between the branch-circuit overcurrent device and the first outlet, it shall be permitted to install a listed outlet branch-circuit-type AFCI at the first outlet to provide protection for the remaining portion of the branch circuit.\n6. Where a listed metal or nonmetallic conduit or tubing or Type MC cable is encased in not less than 50 mm (2 in.) of concrete for the portion of the branch circuit between the branch-circuit overcurrent device and the first outlet, it shall be permitted to install a listed outlet branch-circuit-type AFCI at the first outlet to provide protection for the remaining portion of the branch circuit.\n\nInformational Note: See UL 1699-2011, Standard for Arc-Fault Circuit-Interrupters, for information on combination-type and branch/feeder-type AFCI devices. See UL Subject 1699A, Outline of Investigation for Outlet Branch Circuit Arc-Fault Circuit-Interrupters, for information on outlet branch-circuit type AFCI devices. See UL Subject 1699C, Outline of Investigation for System Combination Arc-Fault Circuit Interrupters, for information on system combination AFCIs.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "14": {
    "content": "210.12(B) Dwelling Units\n\nAll 120-volt, single-phase, 10-, 15-, and 20-ampere branch circuits supplying outlets or devices installed in the following locations shall be protected by any of the means described in 210.12(A)(1) through (A)(6):\n\n- Kitchens\n- Family rooms\n- Dining rooms\n- Living rooms\n- Parlors\n- Libraries\n- Dens\n- Bedrooms\n- Sunrooms\n- Recreation rooms\n- Closets\n- Hallways\n- Laundry areas\n- Similar areas\n\nException No. 1: AFCI protection shall not be required for an individual branch circuit supplying a fire alarm system installed in accordance with 760.41(B) or 760.121(B). The branch circuit shall be installed in a metal raceway, metal auxiliary gutter, steel-armored cable, or Type MC or Type AC cable meeting the applicable requirements of 250.118, with metal boxes, conduit bodies, and enclosures.\n\nException No. 2: AFCI protection shall not be required for the individual branch circuit supplying an outlet for arc welding equipment in a dwelling unit until January 1, 2025.\n\nInformational Note No. 1: See NFPA 72-2022, National Fire Alarm and Signaling Code, 29.9.4(5), for information on secondary power source requirements for smoke alarms installed in dwelling units.\n\nInformational Note No. 2: See 760.41(B) and 760.121(B) for power source requirements for fire alarm systems.\n\n210.12(C) Dormitory Units\n\nAll 120-volt, single-phase, 10-, 15-, and 20-ampere branch circuits supplying outlets or devices installed in the following locations shall be protected by any of the means described in 210.12(A)(1) through (A)(6):\n\n- Bedrooms\n- Living rooms\n- Hallways\n- Closets\n- Bathrooms\n- Similar rooms\n\n210.12(D) Other Occupancies\n\nAll 120-volt, single-phase, 10-, 15-, and 20-ampere branch circuits supplying outlets or devices installed in the following locations shall be protected by any of the means described in 210.12(A)(1) through (A)(6):\n\n- Guest rooms and guest suites of hotels and motels\n- Areas used exclusively as patient sleeping rooms in nursing homes and limited-care facilities\n- Areas designed for use exclusively as sleeping quarters in fire stations, police stations, ambulance stations, rescue stations, ranger stations, and similar locations\n\n210.12(E) Branch Circuit Wiring Extensions, Modifications, or Replacements\n\nIf branch-circuit wiring for any of the areas specified in 210.12(B), (C), or (D) is modified, replaced, or extended, the branch circuit shall be protected by one of the following:\n\n- By any of the means described in 210.12(A)(1) through (A)(6)\n- A listed outlet branch-circuit-type AFCI located at the first receptacle outlet of the existing branch circuit\n\nException: AFCI protection shall not be required where the extension of the existing branch-circuit conductors is not more than 1.8 m (6 ft) and does not include any additional outlets or devices, other than splicing devices. This measurement shall not include the conductors inside an enclosure, cabinet, or junction box.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "15": {
    "content": "210.13 Ground-Fault Protection of Equipment\n\nEach branch-circuit disconnecting means rated 1000 amperes or more and installed on solidly grounded wye electrical systems of more than 150 volts to ground, but not exceeding 1000 volts phase-to-phase, shall be provided with ground-fault protection of equipment in accordance with 230.95.\n\nInformational Note: See 517.17 for requirements on buildings that contain health care occupancies.\n\nException No. 1: This section shall not apply to a disconnecting means for a continuous industrial process where a nonorderly shutdown will introduce additional or increased hazards.\n\nException No. 2: This section shall not apply if ground-fault protection of equipment is provided on the supply side of the branch circuit and on the load side of any transformer supplying the branch circuit.\n\n210.17 Guest Rooms and Guest Suites\n\nGuest rooms and guest suites in the following occupancies that are provided with permanent provisions for cooking shall have branch circuits installed to meet the rules for dwelling units:\n\n- Hotels\n- Motels\n- Assisted living facilities\n\nInformational Note No. 1: See 210.11(C)(2) and 210.52(F), Exception No. 2, for information on laundry branch circuits and receptacle outlets.\n\nInformational Note No. 2: See NFPA 101-2021, Life Safety Code, 3.3.198.12 and A.3.3.198.12(5), for the definition of assisted living facilities.\n\n210.18 Rating\n\nBranch circuits recognized by this article shall be rated in accordance with the maximum permitted ampere rating or setting of the overcurrent device. The rating for other than individual branch circuits shall be 10, 15, 20, 30, 40, and 50 amperes. Where conductors of higher ampacity are used for any reason, the ampere rating or setting of the specified overcurrent device shall determine the circuit rating.\n\nException No. 1: Multioutlet branch circuits greater than 50 amperes shall be permitted to supply nonlighting outlet loads in locations where conditions of maintenance and supervision ensure that only qualified persons service the equipment.\n\nException No. 2: Branch circuits rated 10 amperes shall not supply receptacle outlets.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "16": {
    "content": "210.19 Conductors - Minimum Ampacity and Size\n\nBranch-circuit conductors for circuits not exceeding 1000 volts ac or 1500 volts dc shall be sized in accordance with 210.19(A) through (D).\n\nInformational Note: Conductors for branch circuits as defined in Article 100, sized to prevent a voltage drop exceeding 3 percent at the farthest outlet of power, heating, and lighting loads, or combinations of such loads, and where the maximum total voltage drop on both feeders and branch circuits to the farthest outlet does not exceed 5 percent, provide reasonable efficiency of operation. See 215.21(A)(2). Informational Note No. 2, for information on voltage drop on feeder conductors.\n\n(A) General\n\nBranch-circuit conductors shall have an ampacity not less than the larger of the following and comply with 110.14(C) for equipment terminations:\n\n1. Where a branch circuit supplies continuous loads or any combination of continuous and noncontinuous loads, the minimum branch-circuit conductor size shall have an ampacity not less than the noncontinuous load plus 125 percent of the continuous load in accordance with 310.14.\n   Exception to (1): If the assembly, including the overcurrent devices protecting the branch circuits, is listed for operation at 100 percent of its rating, the ampacity of the branch-circuit conductors shall be permitted to be not less than the sum of the continuous load plus the noncontinuous load in accordance with 110.14(C).\n\n2. The minimum branch-circuit conductor size shall have an ampacity not less than the maximum load to be served after the application of any adjustment or correction factors in accordance with 310.15.\n   Exception to (1) and (2): Where a portion of a branch circuit is connected at both its supply and load ends to separately installed pressure connections as covered in 110.14(C)(2), an allowable ampacity in accordance with 310.15 not less than the sum of the continuous load plus the noncontinuous load shall be permitted. No portion of a branch circuit installed under this exception shall extend into an enclosure containing either the branch-circuit supply or the branch-circuit load terminations.\n\n(B) Branch Circuits With More Than One Receptacle\n\nConductors of branch circuits supplying more than one receptacle for cord-and-plug-connected portable loads shall have an ampacity of not less than the rating of the branch circuit.\n\n(C) Household Ranges and Cooking Appliances\n\nBranch-circuit conductors supplying household ranges, wall-mounted ovens, counter-mounted cooking units, and other household cooking appliances shall have an ampacity not less than the rating of the branch circuit and not less than the maximum load to be served. For ranges of 8 3/4 kW or more rating, the minimum branch-circuit rating shall be 40 amperes.\n\nException No. 1: Conductors tapped from a branch circuit not exceeding 50 amperes supplying electric ranges, wall-mounted electric ovens, and counter-mounted electric cooking units shall have an ampacity of not less than 20 amperes and shall be sufficient for the load to be served. These tap conductors include any conductors that are a part of the leads supplied with the appliance that are smaller than the branch-circuit conductors. The taps shall not be longer than necessary for servicing the appliance.\n\nException No. 2: The neutral conductor of a 3-wire branch circuit supplying a household electric range, a wall-mounted oven, or a counter-mounted cooking unit shall be permitted to be smaller than the ungrounded conductors where the maximum demand of a range of 8 3/4 kW or more rating has been calculated according to Column C of Table 220.55, but such conductor shall have an ampacity of not less than 70 percent of the branch-circuit rating and shall not be smaller than 10 AWG.\n\n(D) Other Loads\n\nBranch-circuit conductors that supply loads other than those specified in 210.3 and other than cooking appliances as covered in 210.19(C) shall have an ampacity sufficient for the loads served and shall not be smaller than 14 AWG.\n\nException No. 1: Tap conductors shall have an ampacity sufficient for the load served. In addition, they shall have an ampacity of not less than 15 for circuits rated less than 40 amperes and not less than 20 for circuits rated at 40 or 50 amperes and only where these tap conductors supply any of the following loads:\n\n1. Individual lampholders or luminaires with taps extending not longer than 450 mm (18 in.) beyond any portion of the lampholder or luminaire\n2. A luminaire having tap conductors in accordance with 410.117\n3. Individual outlets, other than receptacle outlets, with taps not over 450 mm (18 in.) long\n4. Infrared lamp industrial heating appliances\n5. Nonheating leads of deicing and snow-melting cables and mats\n\nException No. 2: Fixture wires and flexible cords shall be permitted to be smaller than 14 AWG as permitted by 240.5.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "17": {
    "content": "210.20 Overcurrent Protection\n\nBranch-circuit conductors and equipment for circuits not exceeding 1000 volts ac or 1500 volts dc shall be protected by overcurrent protective devices that have a rating or setting that complies with 210.20(A) through (D).\n\n(A) Continuous and Noncontinuous Loads\n\nWhere a branch circuit supplies continuous loads or any combination of continuous and noncontinuous loads, the rating of the overcurrent device shall not be less than the noncontinuous load plus 125 percent of the continuous load.\n\nException: Where the assembly, including the overcurrent devices protecting the branch circuit(s), is listed for operation at 100 percent of its rating, the ampere rating of the overcurrent device shall be permitted to be not less than the sum of the continuous load plus the noncontinuous load.\n\n(B) Conductor Protection\n\nConductors shall be protected in accordance with 240.4. Flexible cords and fixture wires shall be protected in accordance with 240.5.\n\n(C) Equipment\n\nThe rating or setting of the overcurrent protective device shall not exceed that specified in the applicable articles referenced in Table 240.3 for equipment.\n\n(D) Outlet Devices\n\nThe rating or setting shall not exceed that specified in 210.21 for outlet devices.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "18": {
    "content": "210.21 Outlet Devices\n\nOutlet devices shall have an ampere rating that is not less than the load to be served and shall comply with 210.21(A) and (B).\n\n(A) Lampholders\n\nWhere connected to a branch circuit having a rating in excess of 20 amperes, lampholders shall be of the heavy-duty type. A heavy-duty lampholder shall have a rating of not less than 660 watts if of the medium type, or not less than 750 watts if of any other type.\n\n(B) Receptacles\n\n(1) Single Receptacle on an Individual Branch Circuit\n\nA single receptacle installed on an individual branch circuit shall have an ampere rating not less than that of the branch circuit.\n\nException No. 1: A receptacle installed in accordance with 430.81(B).\n\nException No. 2: A receptacle installed exclusively for the use of a cord-and-plug-connected arc welder shall be permitted to have an ampere rating not less than the minimum branch-circuit conductor ampacity determined by 630.11(A) for arc welders.\n\nInformational Note: See Article 100 for the definition of receptacle.\n\n(2) Total Cord-and-Plug-Connected Load\n\nWhere connected to a branch circuit supplying two or more receptacles or outlets, a receptacle shall not supply a total cord-and-plug-connected load in excess of the maximum specified in Table 210.21(B)(2).\n\nTable 210.21(B)(2) Maximum Cord-and-Plug-Connected Load to Receptacle\n\nCircuit Rating (Amperes) | Receptacle Rating (Amperes) | Maximum Load (Amperes)\n15 or 20 | 15 | 12\n20 | 20 | 16\n30 | 30 | 24\n\n(3) Receptacle Ratings\n\nWhere connected to a branch circuit supplying two or more receptacles or outlets, receptacle ratings shall not be less than the values listed in Table 210.21(B)(3), or, where rated higher than 50 amperes, the receptacle rating shall not be less than the branch-circuit rating.\n\nException No. 1: Receptacles installed exclusively for the use of cord-and-plug-connected arc welders shall be permitted to have ampere ratings not less than the minimum branch-circuit conductor ampacity determined by 630.11(A) or (B) for arc welders.\n\nException No. 2: The ampere rating of a receptacle installed for electric discharge lighting shall be permitted to be based on 410.62(C).\n\nTable 210.21(B)(3) Receptacle Ratings for Circuits Serving More Than One Receptacle or Receptacle Outlet\n\nCircuit Rating (Amperes) | Receptacle Rating (Amperes)\n15 | 15\n20 | 15 or 20\n30 | 30\n40 | 40 or 50\n50 | 50\n\n(4) Range Receptacle Rating\n\nThe ampere rating of a range receptacle shall be permitted to be based on a single range demand load as specified in Table 220.55.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "19": {
    "content": "210.22 Permissible Loads, Individual Branch Circuits\n\nAn individual branch circuit shall be permitted to supply any load for which it is rated, but in no case shall the load exceed the branch-circuit ampere rating.\n\n210.23 Permissible Loads, Multiple-Outlet Branch Circuits\n\nIn no case shall the load exceed the branch-circuit ampere rating. A branch circuit supplying two or more outlets or receptacles shall supply only the loads specified according to its size in accordance with 210.23(A) through (E) and as summarized in 210.24.\n\n(A) 10-Ampere Branch Circuits\n\nA 10-ampere branch circuit shall comply with the requirements of 210.23(A)(1) and (A)(2).\n\n(1) Loads Permitted for 10-Ampere Branch Circuits\n\nA 10-ampere branch circuit shall be permitted to supply one or more of the following:\n\nLighting outlets\nDwelling unit exhaust fans on bathroom or laundry room lighting circuits\nA gas fireplace unit supplied by an individual branch circuit\n\n(2) Loads Not Permitted for 10-Ampere Branch Circuits\n\nA 10-ampere branch circuit shall not supply any of the following:\n\nReceptacle outlets\nFixed appliances, except as permitted for individual branch circuits\nGarage door openers\nLaundry equipment\n\n(B) 15- And 20-Ampere Branch Circuits\n\nA 15- or 20-ampere branch circuit shall be permitted to supply lighting outlets, lighting units, or other utilization equipment, or any combination of them, and shall comply with 210.23(B)(1) and (B)(2).\n\nException: The small-appliance branch circuits, laundry branch circuits, and bathroom branch circuits required in a dwelling unit(s) by 210.11(C)(1), (C)(2), and (C)(3) shall supply only the receptacle outlets specified in that section.\n\n(1) Cord-and-Plug-Connected Equipment Not Fastened in Place\n\nThe rating of any one cord-and-plug-connected utilization equipment not fastened in place shall not exceed 80 percent of the branch-circuit ampere rating.\n\n(2) Utilization Equipment Fastened in Place\n\nThe total rating of utilization equipment fastened in place, other than luminaires, shall not exceed 50 percent of the branch-circuit ampere rating where lighting units, cord-and-plug-connected utilization equipment not fastened in place, or both, are also supplied.\n\n(C) 30-Ampere Branch Circuits\n\nA 30-ampere branch circuit shall be permitted to supply fixed lighting units with heavy-duty lampholders in other than a dwelling unit(s) or utilization equipment in any occupancy. The rating of any one cord-and-plug-connected utilization equipment shall not exceed 80 percent of the branch-circuit ampere rating.\n\n(D) 40- And 50-Ampere Branch Circuits\n\nA 40- or 50-ampere branch circuit shall be permitted to supply cooking appliances that are fastened in place in any occupancy. In other than dwelling units, such circuits shall be permitted to supply fixed lighting units with heavy-duty lampholders, infrared heating units, or other utilization equipment.\n\n(E) Branch Circuits Larger Than 50 Amperes\n\nBranch circuits larger than 50 amperes shall supply only nonlighting outlet loads.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "20": {
    "content": "210.24 Branch-Circuit Requirements - Summary\n\nThe requirements for circuits that have two or more outlets or receptacles, other than the receptacle circuits of 210.11(C)(1), (C)(2), and (C)(3), are summarized in Table 210.24(1) for copper conductors and Table 210.24(2) for aluminum and copper-clad aluminum conductors. Table 210.24(1) and Table 210.24(2) provide only a summary of minimum requirements. See 210.19, 210.20, and 210.21 for the specific requirements applying to branch circuits.\n\nTable 210.24(1) Summary of Branch-Circuit Requirements - Copper Conductors\n\nCircuit Rating\n\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\n\nConductors (min. size):\nCircuit wires\n14\n14\n12\n10\n8\n6\nTaps\n14\n14\n14\n14\n12\n12\nFixture wires and cords\nSee 240.5.\n\nOvercurrent Protection\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\n\nOutlet devices:\nLampholders permitted\nAny type\nAny type\nAny type\nHeavy duty\nHeavy duty\nHeavy duty\nReceptacle rating1\nNot applicable2\n15 max. A\n15 A or 20 A\n30 A\n40 A or 50 A\n50 A\nMaximum Load\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\nPermissible load\nSee 210.23(A)\nSee 210.23(B)\nSee 210.23(B)\nSee 210.23(C)\nSee 210.23(D)\nSee 210.23(D)\n\n1For receptacle rating of cord-connected electric-discharge luminaires, see 410.62(C).\n2Branch circuits rated 10-amperes shall not supply receptacle outlets.\n\nTable 210.24(2) Summary of Branch-Circuit Requirements - Aluminum and Copper-Clad Aluminum Conductors\n\nCircuit Rating\n\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\n\nConductors (min. size):\nCircuit wires\n12\n12\n10\n8\n6\n4\nTaps\n12\n12\n12\n12\n10\n10\nFixture wires and cords\nSee 240.5.\n\nOvercurrent Protection\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\n\nOutlet devices:\nLampholders permitted\nAny type\nAny type\nAny type\nHeavy duty\nHeavy duty\nHeavy duty\nReceptacle rating1\nNot applicable2\n15 max. A\n15 A or 20 A\n30 A\n40 A or 50 A\n50 A\nMaximum Load\n10 A\n15 A\n20 A\n30 A\n40 A\n50 A\nPermissible load\nSee 210.23(A)\nSee 210.23(B)\nSee 210.23(B)\nSee 210.23(C)\nSee 210.23(D)\nSee 210.23(D)\n\n1For receptacle rating of cord-connected electric-discharge luminaires, see 410.62(C).\n2Branch circuits rated 10-amperes shall not supply receptacle outlets.\n\n210.25 Branch Circuits in Buildings With More Than One Occupancy\n\n(A) Dwelling Unit Branch Circuits\n\nBranch circuits in each dwelling unit shall supply only loads within that dwelling unit or loads associated only with that dwelling unit.\n\n(B) Common Area Branch Circuits\n\nBranch circuits installed for lighting, central alarm, signal, communications, or other purposes for public or common areas of a two-family dwelling, a multifamily dwelling, or a multi-occupancy building shall not be supplied from equipment that supplies an individual dwelling unit or tenant space.\n\nInformational Note: Examples of public or common areas include, but are not limited to, lobbies, corridors, stairways, laundry rooms, roofs, elevators, washrooms, store rooms, driveways (parking), and mechanical rooms.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "21": {
    "content": "Part III Required Outlets\n\n210.50 Receptacle Outlets\n\nDiagram\n\nReceptacle outlets shall be installed as specified in 210.52 through 210.65.\n\nInformational Note: See Informative Annex J for information regarding ADA accessibility design.\n\n(A) Cord Pendants\n\nA cord connector that is supplied by a permanently connected cord pendant shall be considered a receptacle outlet.\n\n(B) Cord Connections\n\nA receptacle outlet shall be installed wherever flexible cords with attachment plugs are used. Where flexible cords are permitted to be permanently connected, receptacles shall be permitted to be omitted for such cords.\n\n(C) Appliance Receptacle Outlets\n\nAppliance receptacle outlets installed in a dwelling unit for specific appliances, such as laundry equipment, shall be installed within 1.8 m (6 ft) of the intended location of the appliance.\n\n210.52 Dwelling Unit Receptacle Outlets\n\nDiagram\n\nThis section provides requirements for 125-volt, 15- and 20-ampere receptacle outlets. The receptacles required by this section shall be in addition to any receptacle that is as follows:\n\nPart of a luminaire or appliance, or\nControlled by a listed wall-mounted control device in accordance with 210.70(A)(1), Exception No. 1, or\nLocated within cabinets or cupboards, or\nLocated more than 1.7 m (51/2 ft) above the floor\nPermanently installed electric baseboard heaters equipped with factory-installed receptacle outlets or outlets provided as a separate assembly by the manufacturer shall be permitted as the required outlet or outlets for the wall space utilized by such permanently installed heaters. Such receptacle outlets shall not be connected to the heater circuits.\n\nInformational Note: Listed baseboard heaters include instructions that may not permit their installation below receptacle outlets.\n\n(A) General Provisions\n\nIn every kitchen, family room, dining room, living room, parlor, library, den, sunroom, bedroom, recreation room, or similar room or area of dwelling units, receptacle outlets shall be installed in accordance with the general provisions specified in 210.52(A)(1) through (A)(4).\n\n(1) Spacing\n\nReceptacles shall be installed such that no point measured horizontally along the floor line of any wall space is more than 1.8 m (6 ft) from a receptacle outlet.\n\n(2) Wall Space\n\nAs used in this section, a wall space shall include the following:\n\nAny space 600 mm (2 ft) or more in width (including space measured around corners) and unbroken along the floor line by doorways and similar openings, fireplaces, stationary appliances, and fixed cabinets that do not have countertops or similar work surfaces\nThe space occupied by fixed panels in walls, excluding sliding panels\nThe space afforded by fixed room dividers, such as freestanding bar-type counters or railings\n\n(3) Floor Receptacles\n\nReceptacle outlets in or on floors shall not be counted as part of the required number of receptacle outlets unless located within 450 mm (18 in.) of the wall.\n\n(4) Countertop and Similar Work Surface Receptacle Outlets\n\nReceptacles installed for countertop and similar work surfaces as specified in 210.52(C) shall not be considered as the receptacle outlets required by 210.52(A).",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "22": {
    "content": "(B) Small Appliances\n\n(1) Receptacle Outlets Served\n\nIn the kitchen, pantry, breakfast room, dining room, or similar area of a dwelling unit, the two or more 20-ampere small-appliance branch circuits required by 210.11(C)(1) shall serve all wall and floor receptacle outlets covered by 210.52(A), all countertop outlets covered by 210.52(C), and receptacle outlets for refrigeration equipment.\n\nException No. 1: In addition to the required receptacles specified by 210.52, switched receptacles supplied from a general-purpose 15- or 20-ampere branch circuit shall be permitted in accordance with 210.70(A)(1), Exception No. 1.\n\nException No. 2: In addition to the required receptacles specified by 210.52, a receptacle outlet to serve a specific appliance shall be permitted to be supplied from an individual branch circuit rated 15 amperes or greater.\n\n(2) No Other Outlets\n\nThe two or more small-appliance branch circuits specified in 210.52(B)(1) shall have no other outlets.\n\nException No. 1: A receptacle installed solely for the electrical supply to and support of an electric clock in any of the rooms specified in 210.52(B)(1) shall be permitted to be served by a small-appliance branch circuit.\n\nException No. 2: Receptacles installed to provide power for supplemental equipment and lighting on gas-fired ranges, ovens, or counter-mounted cooking units shall be permitted to be served by a small-appliance branch circuit.\n\n(3) Kitchen Receptacle Requirements\n\nReceptacles installed in a kitchen to serve countertop surfaces shall be supplied by not fewer than two small-appliance branch circuits, either or both of which shall also be permitted to supply receptacle outlets in the same kitchen and in other rooms specified in 210.52(B)(1). Additional small-appliance branch circuits shall be permitted to supply receptacle outlets in the kitchen and other rooms specified in 210.52(B)(1). No small-appliance branch circuit shall serve more than one kitchen.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link"
  },
  "23": {
    "content": "(C) Countertops and Work Surfaces\n\nIn kitchens, pantries, breakfast rooms, dining rooms, and similar areas of dwelling units, receptacle outlets for countertop and work surfaces that are 300 mm (12 in.) or wider shall be installed in accordance with 210.52(C)(1) through (C)(3) and shall not be considered as the receptacle outlets required by 210.52(A).\n\nFor the purposes of this section, where using multioutlet assemblies, each 300 mm (12 in.) of multioutlet assembly containing two or more receptacles installed in individual or continuous lengths shall be considered to be one receptacle outlet.\n\n(1) Wall Spaces\n\nReceptacle outlets shall be installed so that no point along the wall line is more than 600 mm (24 in.) measured horizontally from a receptacle outlet in that space. The location of the receptacles shall be in accordance with 210.52(C)(3).\n\nException No. 1: Receptacle outlets shall not be required directly behind a range, counter-mounted cooking unit, or sink in the installation described in Figure 210.52(C)(1).\n\nException No. 2: Where a required receptacle outlet cannot be installed in the wall areas shown in Figure 210.52(C)(1), the receptacle outlet shall be permitted to be installed as close as practicable to the countertop area to be served. The total number of receptacle outlets serving the countertop shall not be less than the number needed to satisfy 210.52(C)(1). These outlets shall be located in accordance with 210.52(C)(3).\n\n(2) Island and Peninsular Countertops and Work Surfaces\n\nReceptacle outlets, if installed to serve an island or peninsular countertop or work surface, shall be installed in accordance with 210.52(C)(3). If a receptacle outlet is not provided to serve an island or peninsular countertop or work surface, provisions shall be provided at the island or peninsula for future addition of a receptacle outlet to serve the island or peninsular countertop or work surface.",
    "audio": "https://drive.google.com/file/d/1FH1ncYvUrYEObEf4-GNMu1fgiJQIpv9f/view?usp=drive_link",
    "img": "placeholder",
    "caption": "FIGURE 210.52(C)(1) Determination of Area Behind a Range, Counter-Mounted Cooking Unit, or Sink."
  }
}
